{
  "task_id": "d694a9e573a0",
  "input": "Research and produce a multi-format educational campaign maintaining brand voice across channels to achieve specific engagement and conversion targets.",
  "complexity_score": 65,
  "eval_gen": 1,
  "subtasks": [
    {
      "task_id": "d694a9e573a0.0",
      "input": "Conduct market research to identify target audience demographics, preferences, and competitor strategies to inform campaign positioning.",
      "complexity_score": 70,
      "eval_gen": 2,
      "subtasks": [
        {
          "task_id": "d694a9e573a0.0.0",
          "input": "Collect and analyze demographic data including age, gender, income levels, geographic distribution, and socioeconomic factors of potential customers",
          "complexity_score": 60,
          "eval_gen": 2,
          "subtasks": [
            {
              "task_id": "d694a9e573a0.0.0.0",
              "input": "Gather age data from potential customers and perform statistical analysis to identify dominant age groups and distribution patterns",
              "complexity_score": 60,
              "eval_gen": 2,
              "subtasks": [
                {
                  "task_id": "d694a9e573a0.0.0.0.0",
                  "input": "Implement mechanisms to gather age information from potential customers through digital forms, surveys, or existing databases",
                  "complexity_score": 30,
                  "eval_gen": 2,
                  "subtasks": []
                },
                {
                  "task_id": "d694a9e573a0.0.0.0.1",
                  "input": "Apply statistical methods to analyze collected age data for identifying dominant age groups, distribution patterns, and demographic trends",
                  "complexity_score": 40,
                  "eval_gen": 2,
                  "subtasks": []
                }
              ]
            },
            {
              "task_id": "d694a9e573a0.0.0.1",
              "input": "Obtain gender information from customer records and analyze proportions across different demographic segments",
              "complexity_score": 60,
              "eval_gen": 2,
              "subtasks": [
                {
                  "task_id": "d694a9e573a0.0.0.1.0",
                  "input": "Retrieve gender information from the customer database system using standardized query parameters",
                  "complexity_score": 25,
                  "eval_gen": 2,
                  "subtasks": []
                },
                {
                  "task_id": "d694a9e573a0.0.0.1.1",
                  "input": "Process the extracted gender data to calculate proportional distributions across predefined demographic segments including age groups, geographic regions, and income brackets",
                  "complexity_score": 35,
                  "eval_gen": 2,
                  "subtasks": []
                }
              ]
            },
            {
              "task_id": "d694a9e573a0.0.0.2",
              "input": "Acquire income information and conduct analysis to determine income brackets and economic distribution characteristics",
              "complexity_score": 65,
              "eval_gen": 2,
              "subtasks": [
                {
                  "task_id": "d694a9e573a0.0.0.2.0",
                  "input": "Collect income data from relevant sources including government databases, financial institutions, and survey datasets",
                  "complexity_score": 30,
                  "eval_gen": 2,
                  "subtasks": []
                },
                {
                  "task_id": "d694a9e573a0.0.0.2.1",
                  "input": "Process collected data to calculate income brackets, Gini coefficient, decile distributions, and identify economic inequality patterns",
                  "complexity_score": 50,
                  "eval_gen": 2,
                  "subtasks": []
                }
              ]
            },
            {
              "task_id": "d694a9e573a0.0.0.3",
              "input": "Map customer locations and analyze spatial patterns including regional concentrations and migration trends",
              "complexity_score": 70,
              "eval_gen": 2,
              "subtasks": [
                {
                  "task_id": "d694a9e573a0.0.0.3.0",
                  "input": "Aggregate customer location data from CRM and geolocation systems, then generate a visual map representation with geospatial markers",
                  "complexity_score": 35,
                  "eval_gen": 2,
                  "subtasks": []
                },
                {
                  "task_id": "d694a9e573a0.0.0.3.1",
                  "input": "Apply density analysis algorithms to mapped locations to detect clusters and high-concentration areas by administrative regions",
                  "complexity_score": 25,
                  "eval_gen": 2,
                  "subtasks": []
                },
                {
                  "task_id": "d694a9e573a0.0.0.3.2",
                  "input": "Compare historical location data across time intervals to identify movement patterns and significant relocation trends",
                  "complexity_score": 30,
                  "eval_gen": 2,
                  "subtasks": []
                }
              ]
            },
            {
              "task_id": "d694a9e573a0.0.0.4",
              "input": "Gather data on education levels, occupation types, and social indicators to assess socioeconomic influences on customer behavior",
              "complexity_score": 75,
              "eval_gen": 2,
              "subtasks": [
                {
                  "task_id": "d694a9e573a0.0.0.4.0",
                  "input": "Acquire and verify educational attainment statistics and demographic data from census and institutional sources",
                  "complexity_score": 50,
                  "eval_gen": 2,
                  "subtasks": []
                },
                {
                  "task_id": "d694a9e573a0.0.0.4.1",
                  "input": "Gather occupational classification data including industry sectors, job roles, and employment statistics",
                  "complexity_score": 50,
                  "eval_gen": 2,
                  "subtasks": []
                },
                {
                  "task_id": "d694a9e573a0.0.0.4.2",
                  "input": "Obtain socioeconomic metrics including income distribution, housing patterns, and community development indicators",
                  "complexity_score": 55,
                  "eval_gen": 2,
                  "subtasks": [
                    {
                      "task_id": "d694a9e573a0.0.0.4.2.0",
                      "input": "Gather quantitative metrics on income levels across the population, including median household income, Gini coefficient, poverty rates, and income brackets by demographic groups.",
                      "complexity_score": 35,
                      "eval_gen": 2,
                      "subtasks": []
                    },
                    {
                      "task_id": "d694a9e573a0.0.0.4.2.1",
                      "input": "Gather data on housing characteristics, including homeownership rates, rental costs, housing affordability indices, occupancy density, and geographic distribution of housing types.",
                      "complexity_score": 30,
                      "eval_gen": 2,
                      "subtasks": []
                    },
                    {
                      "task_id": "d694a9e573a0.0.0.4.2.2",
                      "input": "Gather metrics related to community well-being and infrastructure, such as access to public services, transportation, education facilities, business establishment counts, and civic engagement rates.",
                      "complexity_score": 30,
                      "eval_gen": 2,
                      "subtasks": []
                    },
                    {
                      "task_id": "d694a9e573a0.0.0.4.2.3",
                      "input": "Combine the collected datasets from the three domains, ensuring temporal and geographic alignment, checking for consistency, and preparing a unified dataset for analysis.",
                      "complexity_score": 25,
                      "eval_gen": 2,
                      "subtasks": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "task_id": "d694a9e573a0.0.1",
          "input": "Research consumer preferences, purchasing behaviors, brand loyalty patterns, and media consumption habits through surveys and existing market data",
          "complexity_score": 65,
          "eval_gen": 2,
          "subtasks": [
            {
              "task_id": "d694a9e573a0.0.1.0",
              "input": "Design and distribute surveys to collect primary data on consumer preferences, purchasing behaviors, brand loyalty patterns, and media consumption habits.",
              "complexity_score": 40,
              "eval_gen": 2,
              "subtasks": []
            },
            {
              "task_id": "d694a9e573a0.0.1.1",
              "input": "Extract and analyze trends from existing secondary market data sources to understand consumer preferences, purchasing behaviors, brand loyalty patterns, and media consumption habits.",
              "complexity_score": 35,
              "eval_gen": 2,
              "subtasks": []
            }
          ]
        },
        {
          "task_id": "d694a9e573a0.0.2",
          "input": "Analyze key competitors' marketing positioning, pricing strategies, distribution channels, promotional tactics, and market share trends",
          "complexity_score": 65,
          "eval_gen": 2,
          "subtasks": [
            {
              "task_id": "d694a9e573a0.0.2.0",
              "input": "Research and compare competitors' brand messaging, value propositions, and target audience alignment across all communication channels",
              "complexity_score": 68,
              "eval_gen": 2,
              "subtasks": [
                {
                  "task_id": "d694a9e573a0.0.2.0.0",
                  "input": "Gather brand messaging content from all communication channels (e.g., websites, social media, ads) for each competitor.",
                  "complexity_score": 65,
                  "eval_gen": 2,
                  "subtasks": [
                    {
                      "task_id": "d694a9e573a0.0.2.0.0.0",
                      "input": "Gather brand messaging content from the websites of all competitors.",
                      "complexity_score": 60,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.0.0.0.0",
                          "input": "Determine and list all competitor brands and their corresponding official websites to be analyzed.",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.0.0.0.1",
                          "input": "Retrieve the content from each identified competitor's website using web scraping or API methods.",
                          "complexity_score": 25,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.0.0.0.2",
                          "input": "Identify and extract key brand messaging components such as slogans, mission statements, and value propositions from the retrieved website content.",
                          "complexity_score": 30,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.0.0.0.3",
                          "input": "Organize the extracted brand messaging elements into a standardized format or report for further analysis.",
                          "complexity_score": 15,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.0.0.1",
                      "input": "Gather brand messaging content from the social media platforms of all competitors.",
                      "complexity_score": 60,
                      "eval_gen": 2,
                      "subtasks": []
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.0.0.2",
                      "input": "Gather brand messaging content from the advertisements of all competitors across relevant platforms.",
                      "complexity_score": 60,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.0.0.2.0",
                          "input": "Determine all active competitors operating in the relevant market segments requiring analysis",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.0.0.2.1",
                          "input": "Gather all available advertisements from identified competitors across relevant digital and traditional platforms",
                          "complexity_score": 30,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.0.0.2.2",
                          "input": "Isolate brand messaging content from collected advertisements while maintaining contextual integrity",
                          "complexity_score": 25,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.0.0.2.3",
                          "input": "Organize extracted brand messaging content into a standardized format for comparative analysis",
                          "complexity_score": 15,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "task_id": "d694a9e573a0.0.2.0.1",
                  "input": "Extract value propositions from all communication channels (e.g., product pages, marketing materials, press releases) for each competitor.",
                  "complexity_score": 65,
                  "eval_gen": 2,
                  "subtasks": [
                    {
                      "task_id": "d694a9e573a0.0.2.0.1.0",
                      "input": "Extract value propositions specifically from product pages of all competitors",
                      "complexity_score": 60,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.0.1.0.0",
                          "input": "Retrieve a comprehensive list of competitor companies from the database or external sources",
                          "complexity_score": 30,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.0.1.0.1",
                          "input": "For each identified competitor, programmatically navigate to their official product pages using web scraping or API access",
                          "complexity_score": 50,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.0.1.0.2",
                          "input": "Use NLP techniques or pattern recognition to isolate value proposition statements from product page content",
                          "complexity_score": 60,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.0.1.0.3",
                          "input": "Aggregate extracted value propositions into a structured dataset with competitor and product metadata",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.0.1.1",
                      "input": "Extract value propositions specifically from marketing materials of all competitors",
                      "complexity_score": 65,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.0.1.1.0",
                          "input": "Aggregate all relevant marketing documents, websites, and promotional content from identified competitors",
                          "complexity_score": 40,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.0.1.1.1",
                          "input": "Process collected materials to detect recurring themes, differentiators, and benefit statements",
                          "complexity_score": 50,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.0.1.1.2",
                          "input": "Formalize identified value propositions into standardized format with source attribution",
                          "complexity_score": 30,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.0.1.2",
                      "input": "Extract value propositions specifically from press releases of all competitors",
                      "complexity_score": 70,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.0.1.2.0",
                          "input": "Gather press releases from all identified competitors through official channels, websites, or news aggregators",
                          "complexity_score": 30,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.0.1.2.1",
                          "input": "Apply NLP techniques to detect value proposition markers (e.g., 'Our solution provides...', 'Customers benefit from...') in each press release",
                          "complexity_score": 35,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.0.1.2.2",
                          "input": "Isolate identified value propositions and standardize their format across different competitor press releases",
                          "complexity_score": 25,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "task_id": "d694a9e573a0.0.2.0.2",
                  "input": "Identify target audience demographics, personas, and engagement patterns across all communication channels for each competitor.",
                  "complexity_score": 67,
                  "eval_gen": 2,
                  "subtasks": [
                    {
                      "task_id": "d694a9e573a0.0.2.0.2.0",
                      "input": "Identify and document all communication channels utilized by each competitor for audience engagement",
                      "complexity_score": 58,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.0.2.0.0",
                          "input": "Establish the specific list of competitors to analyze and define the temporal scope (e.g., last 6 months) and geographic/audience scope for the analysis of communication channels.",
                          "complexity_score": 15,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.0.2.0.1",
                          "input": "Determine the broad categories of communication channels to investigate for each competitor (e.g., Owned Media: website, app; Earned Media: press coverage; Social Media: platforms like Instagram, TikTok; Direct Channels: email, SMS; Partner Channels: collaborations, affiliates).",
                          "complexity_score": 12,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.0.2.0.2",
                          "input": "For each defined competitor, systematically collect observable data on their active communication channels within the defined scope. This involves visiting their digital properties, reviewing public content, and noting all visible engagement avenues.",
                          "complexity_score": 25,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.0.2.0.3",
                          "input": "For each identified channel per competitor, record specific details such as channel name, target audience segment, observed posting frequency, and any available public engagement metrics (e.g., follower counts, average likes/shares).",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.0.2.0.4",
                          "input": "Synthesize the gathered data into a structured deliverable (e.g., spreadsheet, report) that clearly lists each competitor and their utilized communication channels with associated details, ready for review or analysis.",
                          "complexity_score": 10,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.0.2.1",
                      "input": "Gather and analyze demographic data (age, gender, location, income level) of target audiences for each competitor",
                      "complexity_score": 62,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.0.2.1.0",
                          "input": "Extract age, gender, location, and income level data for target audiences from each competitor's available data sources",
                          "complexity_score": 42,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.0.2.1.1",
                          "input": "Apply statistical methods to identify significant trends, correlations, and distinguishing characteristics in the collected demographic data across competitors",
                          "complexity_score": 38,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.0.2.2",
                      "input": "Identify and document audience interaction patterns (frequency, preferred channels, content types) for each competitor",
                      "complexity_score": 65,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.0.2.2.0",
                          "input": "Gather raw interaction data (posts, comments, shares) across social platforms and websites for each competitor's audience",
                          "complexity_score": 58,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.0.2.0.2.2.0.0",
                              "input": "Compile a definitive list of competitor entities and map their official social media accounts (e.g., Facebook, X/Twitter, Instagram, LinkedIn, YouTube) and primary websites or blogs where audience interaction occurs.",
                              "complexity_score": 15,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.0.2.2.0.1",
                              "input": "Set up and authenticate the necessary APIs or web scraping tools (e.g., platform-specific APIs, browser automation) for each identified social platform and website to enable data access.",
                              "complexity_score": 25,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.0.2.2.0.2",
                              "input": "Execute data collection to retrieve all posts, articles, or published content from the official competitor channels identified, including metadata like timestamp, content type, and engagement counts.",
                              "complexity_score": 20,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.0.2.2.0.3",
                              "input": "Collect all user-generated comments, replies, and threaded discussions associated with the gathered competitor posts and content.",
                              "complexity_score": 25,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.0.2.2.0.4",
                              "input": "Collect data on shares, re-tweets, re-posts, and other forms of content redistribution by the audience across the monitored platforms.",
                              "complexity_score": 20,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.0.2.2.0.5",
                              "input": "Consolidate all raw data (posts, comments, shares) into a structured, per-competitor dataset, ensuring data integrity and proper tagging of source platform and collection timestamp.",
                              "complexity_score": 15,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.0.2.2.1",
                          "input": "Process collected data to identify temporal patterns (daily/weekly/monthly cycles) and engagement spikes for each competitor",
                          "complexity_score": 62,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.0.2.0.2.2.1.0",
                              "input": "Convert all collected timestamps to a standardized format (ISO 8601) and resolve timezone discrepancies across competitor datasets",
                              "complexity_score": 60,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.0.2.2.1.1",
                              "input": "Create daily/weekly/monthly summary statistics (mean, median, standard deviation) for engagement metrics per competitor after normalization",
                              "complexity_score": 75,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.0.2.2.1.2",
                              "input": "Apply Fourier transforms and autocorrelation analysis to identify statistically significant daily/weekly/monthly cycles in engagement trends",
                              "complexity_score": 82,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.0.2.2.1.3",
                              "input": "Use z-score analysis and peak detection algorithms to flag statistically significant engagement spikes exceeding 3σ thresholds",
                              "complexity_score": 78,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.0.2.2.1.4",
                              "input": "Merge periodic pattern findings and anomaly detections into structured reports organized by competitor and time granularity",
                              "complexity_score": 65,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.0.2.2.2",
                          "input": "Quantify platform-specific engagement rates and audience migration patterns between channels for each competitor",
                          "complexity_score": 64,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.0.2.0.2.2.2.0",
                              "input": "Measure and calculate engagement metrics unique to each platform for every competitor's channels.",
                              "complexity_score": 50,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.0.2.2.2.1",
                              "input": "Track and quantify cross-channel audience movement patterns across platforms for each competitor.",
                              "complexity_score": 50,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.0.2.2.3",
                          "input": "Categorize content formats (video, text, infographics) and topics with highest engagement metrics per competitor",
                          "complexity_score": 60,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.0.2.0.2.2.3.0",
                              "input": "Aggregate engagement metrics (views, shares, likes) for video, text, and infographics content across all competitors",
                              "complexity_score": 75,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.0.2.2.3.1",
                              "input": "Analyze collected metrics to determine statistically significant high-engagement content formats per competitor",
                              "complexity_score": 65,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.0.2.2.3.2",
                              "input": "Extract and quantify engagement metrics for content topics across all competitor channels",
                              "complexity_score": 70,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.0.2.2.3.3",
                              "input": "Apply statistical analysis to topic engagement data to identify top-performing topics per competitor",
                              "complexity_score": 60,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.0.2.2.3.4",
                              "input": "Compile format and topic categorization results into structured competitor engagement profiles",
                              "complexity_score": 55,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.0.2.2.4",
                          "input": "Compile analyzed metrics into standardized competitor comparison framework with visualizations",
                          "complexity_score": 55,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.0.2.0.2.2.4.0",
                              "input": "Take the analyzed metrics and map them to the required fields and categories of the standardized competitor comparison framework. This involves formatting the raw metric data into the specific structure (e.g., tables, scorecards) defined by the framework.",
                              "complexity_score": 15,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.0.2.2.4.1",
                              "input": "Insert the formatted metric data into the standardized framework template. This task involves filling in the pre-defined sections (e.g., feature parity, pricing tiers, market share) with the compiled data for each competitor.",
                              "complexity_score": 12,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.0.2.2.4.2",
                              "input": "Determine the most effective visual representations (e.g., bar charts for feature counts, radar charts for scoring, line graphs for trends) for the key comparisons within the populated framework. Define chart types, data sources, axes, and labeling requirements.",
                              "complexity_score": 18,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.0.2.2.4.3",
                              "input": "Create the visual charts and graphs as specified, using the data from the populated framework. This task executes the generation of the visual assets.",
                              "complexity_score": 10,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.0.2.3",
                      "input": "Create detailed audience personas based on demographic data and engagement patterns analysis",
                      "complexity_score": 59,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.0.2.3.0",
                          "input": "Process raw demographic data to identify distinct segments based on attributes like age, location, income, education, and occupation. This involves cleaning, grouping, and summarizing the data to form the foundational clusters for persona creation.",
                          "complexity_score": 35,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.0.2.3.1",
                          "input": "Examine user interaction data (e.g., content consumption, feature usage, session frequency) and correlate it with the demographic segments. Identify patterns of behavior, preferences, and activity levels for each segment.",
                          "complexity_score": 40,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.0.2.3.2",
                          "input": "Combine the demographic and behavioral analyses to create coherent, detailed persona profiles. For each key segment, define persona name, photo, demographics, goals, pain points, motivations, and a representative quote, crafting a narrative that brings the data to life.",
                          "complexity_score": 45,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.0.2.3.3",
                          "input": "Assemble the synthesized personas into a structured, presentable format (e.g., a report, slide deck, or wiki page). Ensure visual consistency, add supporting charts from the analysis, and include a summary of methodology and key insights.",
                          "complexity_score": 25,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "task_id": "d694a9e573a0.0.2.0.3",
                  "input": "Analyze collected data to compare competitors' brand messaging consistency, value proposition differentiation, and audience alignment effectiveness across channels.",
                  "complexity_score": 72,
                  "eval_gen": 2,
                  "subtasks": [
                    {
                      "task_id": "d694a9e573a0.0.2.0.3.0",
                      "input": "Assess the uniformity of competitors' brand messaging across all collected channels using linguistic pattern analysis and tone mapping techniques.",
                      "complexity_score": 52,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.0.3.0.0",
                          "input": "Process the raw data collected from each competitor's channels (e.g., social media, websites, ads) to isolate the textual content that constitutes their brand messaging, preparing it for linguistic analysis.",
                          "complexity_score": 25,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.0.3.0.1",
                          "input": "Apply NLP techniques (e.g., keyword frequency, topic modeling, sentiment lexicons) to identify recurring linguistic patterns, key terms, and semantic themes within each competitor's messaging corpus.",
                          "complexity_score": 30,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.0.3.0.2",
                          "input": "Analyze the extracted content to map and quantify the tone (e.g., formal, casual, enthusiastic, authoritative) used by each competitor, comparing the consistency of that tone across their different communication channels.",
                          "complexity_score": 25,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.0.3.0.3",
                          "input": "Compare the results of the linguistic pattern and tone analyses across all competitors and channels. Generate a consolidated assessment scoring the uniformity of each competitor's brand messaging and highlighting key disparities.",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.0.3.1",
                      "input": "Quantify distinctiveness of competitors' value propositions through feature comparison matrices and unique selling point clustering analysis.",
                      "complexity_score": 48,
                      "eval_gen": 2,
                      "subtasks": []
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.0.3.2",
                      "input": "Analyze engagement metrics correlation with demographic targeting precision using channel-specific conversion funnels and audience segmentation models.",
                      "complexity_score": 54,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.0.3.2.0",
                          "input": "Gather and prepare engagement metrics (clicks, views, time spent, shares) segmented by marketing channel (social, email, search, display) for the analysis period.",
                          "complexity_score": 15,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.0.3.2.1",
                          "input": "Compile data on targeting precision, including audience match rates, demographic accuracy scores, and segmentation purity metrics for each campaign.",
                          "complexity_score": 18,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.0.3.2.2",
                          "input": "Define and structure conversion funnel stages (awareness, consideration, conversion, retention) specific to each marketing channel for correlation analysis.",
                          "complexity_score": 16,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.0.3.2.3",
                          "input": "Perform statistical correlation analysis between engagement metrics and demographic targeting precision scores across channel-specific funnels.",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.0.3.2.4",
                          "input": "Run existing audience segmentation models to identify demographic clusters and assess how targeting precision varies across segments.",
                          "complexity_score": 17,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.0.3.2.5",
                          "input": "Combine correlation results with segmentation model outputs to produce actionable insights on optimizing demographic targeting per channel.",
                          "complexity_score": 19,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "task_id": "d694a9e573a0.0.2.1",
              "input": "Analyze competitors' pricing models, discount structures, and price positioning relative to market segments and product lifecycle stages",
              "complexity_score": 62,
              "eval_gen": 2,
              "subtasks": [
                {
                  "task_id": "d694a9e573a0.0.2.1.0",
                  "input": "Identify and categorize pricing strategies (e.g., cost-based, value-based, penetration) used by competitors across different market segments and product lifecycle stages",
                  "complexity_score": 65,
                  "eval_gen": 2,
                  "subtasks": [
                    {
                      "task_id": "d694a9e573a0.0.2.1.0.0",
                      "input": "Gather pricing data from competitors across all relevant market segments and product lifecycle stages using market research tools and public databases",
                      "complexity_score": 70,
                      "eval_gen": 2,
                      "subtasks": []
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.1.0.1",
                      "input": "Analyze collected data to detect recurring pricing patterns and correlations with product/market characteristics",
                      "complexity_score": 75,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.1.0.1.0",
                          "input": "Clean, normalize, and structure raw data for analysis by handling missing values, outliers, and format inconsistencies",
                          "complexity_score": 70,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.1.0.1.1",
                          "input": "Apply statistical clustering and time-series analysis to detect recurring price structures across products and markets",
                          "complexity_score": 75,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.0.2.1.0.1.1.0",
                              "input": "Collect and preprocess historical price data across products and markets, including normalization and outlier removal",
                              "complexity_score": 15,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.1.0.1.1.1",
                              "input": "Use clustering techniques (e.g., k-means, DBSCAN) to group similar price structures across products",
                              "complexity_score": 20,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.1.0.1.1.2",
                              "input": "Apply time-series decomposition and pattern recognition to identify temporal price trends",
                              "complexity_score": 20,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.1.0.1.1.3",
                              "input": "Combine clustered price structures with temporal patterns to form composite price signatures",
                              "complexity_score": 15,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.1.0.1.1.4",
                              "input": "Validate and cross-market match composite price signatures to detect recurring structures",
                              "complexity_score": 5,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.1.0.1.2",
                          "input": "Examine relationships between pricing patterns and product attributes (category, features, quality tiers)",
                          "complexity_score": 70,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.0.2.1.0.1.2.0",
                              "input": "Examine correlations between pricing strategies and product categories across different market segments",
                              "complexity_score": 62,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.1.0.1.2.1",
                              "input": "Assess how specific product features influence pricing decisions across comparable product lines",
                              "complexity_score": 65,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.1.0.1.2.2",
                              "input": "Investigate alignment between defined quality tiers and corresponding pricing levels in the product hierarchy",
                              "complexity_score": 60,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.1.0.1.2.3",
                              "input": "Integrate findings from category, feature, and quality tier analyses to identify multi-dimensional pricing patterns",
                              "complexity_score": 75,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.1.0.1.3",
                          "input": "Investigate connections between pricing patterns and market factors (geography, competition density, demand elasticity)",
                          "complexity_score": 70,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.1.0.1.4",
                          "input": "Combine pattern detection and correlation analysis results into comprehensive pricing behavior insights",
                          "complexity_score": 65,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.0.2.1.0.1.4.0",
                              "input": "Merge normalized pattern detection results with temporal context metadata to create structured input for cross-analysis",
                              "complexity_score": 42,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.1.0.1.4.1",
                              "input": "Transform statistical correlation outputs into directional relationship graphs between pricing variables and external factors",
                              "complexity_score": 38,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.1.0.1.4.2",
                              "input": "Combine integrated patterns with correlation graphs to generate dynamic pricing behavior models with confidence thresholds",
                              "complexity_score": 45,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.1.0.2",
                      "input": "Map identified patterns to established pricing strategy frameworks (cost-based, value-based, penetration, etc.)",
                      "complexity_score": 60,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.1.0.2.0",
                          "input": "List and validate relevant pricing strategy frameworks (cost-based, value-based, penetration, etc.) against organizational constraints and market conditions",
                          "complexity_score": 15,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.1.0.2.1",
                          "input": "Evaluate identified pricing patterns against each framework's core principles and implementation requirements to determine compatibility scores",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.1.0.2.2",
                          "input": "Group patterns into primary/secondary framework classifications based on alignment analysis, including hybrid strategy possibilities",
                          "complexity_score": 15,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.1.0.2.3",
                          "input": "Formalize mapping outcomes into actionable pricing strategy recommendations with implementation considerations for each framework category",
                          "complexity_score": 10,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.1.0.3",
                      "input": "Analyze relationships between classified pricing strategies and corresponding market segments/product lifecycle stages",
                      "complexity_score": 65,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.1.0.3.0",
                          "input": "Identify and document associations between pricing strategy classifications and their corresponding market segment definitions",
                          "complexity_score": 15,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.1.0.3.1",
                          "input": "Establish relationships between pricing strategy classifications and product lifecycle stage definitions",
                          "complexity_score": 15,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.1.0.3.2",
                          "input": "Examine how pricing strategies interact with both market segments and product lifecycle stages simultaneously",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.1.0.3.3",
                          "input": "Assess how identified relationships affect revenue, market share, and product adoption metrics",
                          "complexity_score": 15,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.1.0.4",
                      "input": "Cross-validate strategy classifications against multiple data sources and industry benchmarks",
                      "complexity_score": 50,
                      "eval_gen": 2,
                      "subtasks": []
                    }
                  ]
                },
                {
                  "task_id": "d694a9e573a0.0.2.1.1",
                  "input": "Analyze frequency, depth, and conditions of discounts offered by competitors, segmented by customer groups and product maturity phases",
                  "complexity_score": 60,
                  "eval_gen": 2,
                  "subtasks": [
                    {
                      "task_id": "d694a9e573a0.0.2.1.1.0",
                      "input": "Aggregate discount data from public sources, competitor websites, and market intelligence tools across all relevant customer groups and product maturity phases",
                      "complexity_score": 70,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.1.1.0.0",
                          "input": "Extract discount data from public sources including government databases, industry reports, and regulatory filings across all customer segments and product lifecycle stages",
                          "complexity_score": 70,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.0.2.1.1.0.0.0",
                              "input": "Query official government databases and portals containing publicly available discount information, including procurement records, subsidy registries, and pricing regulations",
                              "complexity_score": 72,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.1.1.0.0.1",
                              "input": "Collect and parse discount information from third-party industry analysis reports, market research publications, and sector-specific white papers",
                              "complexity_score": 68,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.1.1.0.0.2",
                              "input": "Retrieve discount-related information from mandatory regulatory disclosures, including SEC filings, competition authority submissions, and compliance documentation",
                              "complexity_score": 75,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.1.1.0.1",
                          "input": "Automate extraction of discount information from competitor websites, including promotional pages, pricing calculators, and customer-specific offers across all relevant customer groups",
                          "complexity_score": 75,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.0.2.1.1.0.1.0",
                              "input": "Establish connections to competitor websites, handle authentication mechanisms, and navigate to discount information sources including promotional pages and pricing calculators",
                              "complexity_score": 70,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.1.1.0.1.1",
                              "input": "Capture dynamic content from pricing calculators, scrape promotional page elements, and extract customer-specific offer parameters while respecting website terms of service",
                              "complexity_score": 78,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.1.1.0.1.2",
                              "input": "Convert unstructured web data into standardized format, resolve inconsistencies in discount representations, and map customer group-specific offers to organizational taxonomy",
                              "complexity_score": 72,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.1.1.0.1.3",
                              "input": "Combine normalized data across all competitor sources, identify pricing trends, and generate insights about customer group-specific discount strategies",
                              "complexity_score": 80,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.1.1.0.2",
                          "input": "Retrieve discount data from market intelligence platforms and third-party analytics tools that track pricing trends and competitive positioning across different product maturity phases",
                          "complexity_score": 65,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.1.1.0.3",
                          "input": "Consolidate and normalize discount data from all collected sources, resolving conflicts and standardizing formats across customer groups and product lifecycle phases",
                          "complexity_score": 80,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.0.2.1.1.0.3.0",
                              "input": "Collect and bring together all discount information gathered from various sources (e.g., CRM, pricing sheets, legacy systems) into a single, unified dataset for initial processing.",
                              "complexity_score": 25,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.1.1.0.3.1",
                              "input": "Analyze the aggregated discount data to detect inconsistencies, overlaps, or contradictions (e.g., different discount percentages for the same customer group) and mark them for resolution.",
                              "complexity_score": 30,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.1.1.0.3.2",
                              "input": "Apply predefined business rules (e.g., 'most recent wins', 'highest authority source wins') to decide on the correct value for each conflicting discount entry, producing a single authoritative dataset.",
                              "complexity_score": 35,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.1.1.0.3.3",
                              "input": "Transform the resolved discount data into a common, standardized schema. This includes normalizing units (e.g., percent vs. fixed amount), date formats, customer group identifiers, and product lifecycle phase labels.",
                              "complexity_score": 25,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.1.1.0.3.4",
                              "input": "Perform a final check to ensure the consolidated and normalized data adheres to all overarching business policies (e.g., discount caps per customer segment, validity periods within lifecycle phases).",
                              "complexity_score": 20,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.1.1.1",
                      "input": "Categorize collected discount data into predefined customer segments (e.g., enterprise, SME, retail) while maintaining relationship to product maturity phases",
                      "complexity_score": 55,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.1.1.1.0",
                          "input": "Retrieve collected discount data ensuring each record contains customer identifiers and associated product maturity phase information. Validate data completeness and format for segmentation processing.",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.1.1.1.1",
                          "input": "Apply business rules to assign each customer to appropriate segment (enterprise, SME, retail) based on customer attributes present in the discount data.",
                          "complexity_score": 15,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.1.1.1.2",
                          "input": "Link each discount record to its corresponding product maturity phase (e.g., introduction, growth, maturity, decline) using product lifecycle data.",
                          "complexity_score": 15,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.1.1.1.3",
                          "input": "Produce categorized output showing discount data organized by customer segment while preserving the connection to product maturity phases for analysis.",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.1.1.2",
                      "input": "Classify discounts according to product lifecycle stages (introduction, growth, maturity, decline) while preserving customer group associations",
                      "complexity_score": 55,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.1.1.2.0",
                          "input": "Retrieve the raw data containing discount offers and their associated customer groups from the source system.",
                          "complexity_score": 15,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.1.1.2.1",
                          "input": "Retrieve the data mapping products to their current lifecycle stages (introduction, growth, maturity, decline).",
                          "complexity_score": 15,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.1.1.2.2",
                          "input": "Merge the discount/customer group data with the product lifecycle data using the product ID as the key, creating a unified dataset.",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.1.1.2.3",
                          "input": "For each product lifecycle stage, apply the specific business rules to categorize the associated discounts (e.g., 'introductory offer', 'growth promotion', 'maturity loyalty discount', 'clearance sale').",
                          "complexity_score": 25,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.1.1.2.4",
                          "input": "Produce the final output, a structured list or report where each discount is classified by lifecycle stage, and the original link to customer groups is preserved and displayed.",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.1.1.3",
                      "input": "Perform statistical analysis on segmented data to determine discount frequency distributions, depth ranges, and conditional triggers across all dimensions",
                      "complexity_score": 65,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.1.1.3.0",
                          "input": "Analyze segmented data to compute frequency distributions of discounts across all dimensions, including temporal patterns and category-based variations",
                          "complexity_score": 72,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.0.2.1.1.3.0.0",
                              "input": "Identify time-based discount distribution patterns across different time granularities (daily/weekly/monthly)",
                              "complexity_score": 25,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.1.1.3.0.1",
                              "input": "Analyze discount frequency differences across product/service categories and subcategories",
                              "complexity_score": 25,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.1.1.3.0.2",
                              "input": "Aggregate and correlate discount distributions across all available dimensions simultaneously",
                              "complexity_score": 30,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.1.1.3.0.3",
                              "input": "Verify the integrity and completeness of input segmented data before analysis",
                              "complexity_score": 10,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.1.1.3.1",
                          "input": "Quantify discount depth ranges for each segment using statistical measures like mean, median, and standard deviation across all dimensional combinations",
                          "complexity_score": 68,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.0.2.1.1.3.1.0",
                              "input": "Collect all relevant discount depth data across all segments and dimensional combinations from transactional databases and pricing systems",
                              "complexity_score": 20,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.1.1.3.1.1",
                              "input": "Compute mean, median, and standard deviation values for discount depths within each segment using the collected data",
                              "complexity_score": 30,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.1.1.3.1.2",
                              "input": "Identify discount depth ranges by examining statistical distributions and segment-specific variance patterns",
                              "complexity_score": 25,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.1.1.3.1.3",
                              "input": "Document quantified discount depth ranges with statistical confidence intervals for each market segment",
                              "complexity_score": 15,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.1.1.3.2",
                          "input": "Perform correlation analysis and hypothesis testing to identify statistically significant conditional triggers for discount activation across dimensions",
                          "complexity_score": 78,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.0.2.1.1.3.2.0",
                              "input": "Clean, normalize, and structure dataset containing discount activation events and associated dimension variables for statistical analysis",
                              "complexity_score": 65,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.1.1.3.2.1",
                              "input": "Calculate pairwise correlation coefficients between discount activation metrics and all dimensional variables across time and user segments",
                              "complexity_score": 72,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.1.1.3.2.2",
                              "input": "Define null/alternative hypotheses and significance thresholds for each dimension, selecting appropriate statistical tests (t-test, chi-square, etc.)",
                              "complexity_score": 68,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.1.1.3.2.3",
                              "input": "Execute hypothesis tests on high-correlation dimension pairs, calculating p-values and confidence intervals to identify significant triggers",
                              "complexity_score": 70,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.1.1.3.2.4",
                              "input": "Aggregate and interpret statistical results to map significant conditional triggers across dimensional hierarchies and interaction effects",
                              "complexity_score": 63,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.1.1.3.3",
                          "input": "Cross-validate results across all segments and dimensions to ensure statistical significance and dimensional coherence in the findings",
                          "complexity_score": 63,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.0.2.1.1.3.3.0",
                              "input": "Apply statistical tests to confirm significance thresholds within each data segment",
                              "complexity_score": 58,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.1.1.3.3.1",
                              "input": "Compare dimension interactions between segments to identify structural inconsistencies",
                              "complexity_score": 62,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.1.1.3.3.2",
                              "input": "Identify and document conflicting patterns between segment-specific findings",
                              "complexity_score": 55,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.1.1.3.3.3",
                              "input": "Confirm aggregated findings satisfy overall statistical validity and dimensional integrity requirements",
                              "complexity_score": 60,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "task_id": "d694a9e573a0.0.2.1.2",
                  "input": "Compare competitors' pricing relative to their product positioning and target segments at different lifecycle stages (e.g., introductory vs. mature markets)",
                  "complexity_score": 62,
                  "eval_gen": 2,
                  "subtasks": [
                    {
                      "task_id": "d694a9e573a0.0.2.1.2.0",
                      "input": "Gather pricing data across different lifecycle stages (introductory, mature) for each competitor.",
                      "complexity_score": 65,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.1.2.0.0",
                          "input": "Collect pricing information for competitors' products during their introductory lifecycle stage.",
                          "complexity_score": 55,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.1.2.0.1",
                          "input": "Collect pricing information for competitors' products during their mature lifecycle stage.",
                          "complexity_score": 55,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.1.2.1",
                      "input": "Evaluate competitors' product positioning strategies across various lifecycle stages.",
                      "complexity_score": 60,
                      "eval_gen": 2,
                      "subtasks": []
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.1.2.2",
                      "input": "Determine the target customer segments each competitor focuses on at different lifecycle stages.",
                      "complexity_score": 60,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.1.2.2.0",
                          "input": "Gather publicly available marketing materials, campaigns, and messaging from each competitor across digital and traditional channels.",
                          "complexity_score": 25,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.1.2.2.1",
                          "input": "Analyze collected data to extract demographic, behavioral, and psychographic indicators used by competitors in their targeting strategies.",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.1.2.2.2",
                          "input": "Correlate identified segment indicators with known customer lifecycle stages (awareness, consideration, purchase, retention, advocacy).",
                          "complexity_score": 15,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.1.2.2.3",
                          "input": "Cross-reference mapped segments with competitor product offerings, pricing tiers, and channel-specific messaging patterns.",
                          "complexity_score": 10,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.1.2.3",
                      "input": "Synthesize pricing data, product positioning, and target segments to identify correlations and competitive positioning.",
                      "complexity_score": 70,
                      "eval_gen": 2,
                      "subtasks": []
                    }
                  ]
                }
              ]
            },
            {
              "task_id": "d694a9e573a0.0.2.2",
              "input": "Map competitors' sales channels, logistics networks, and channel partner relationships across physical and digital platforms",
              "complexity_score": 64,
              "eval_gen": 2,
              "subtasks": [
                {
                  "task_id": "d694a9e573a0.0.2.2.0",
                  "input": "Identify and document all physical and digital sales channels used by competitors, including direct/indirect channels, e-commerce platforms, retail partnerships, and distribution networks.",
                  "complexity_score": 21,
                  "eval_gen": 2,
                  "subtasks": []
                },
                {
                  "task_id": "d694a9e573a0.0.2.2.1",
                  "input": "Analyze and record competitors' logistics infrastructure, including warehousing, transportation systems, fulfillment centers, and last-mile delivery partnerships across physical and digital domains.",
                  "complexity_score": 22,
                  "eval_gen": 2,
                  "subtasks": []
                },
                {
                  "task_id": "d694a9e573a0.0.2.2.2",
                  "input": "Document relationships with channel partners such as distributors, resellers, affiliates, and platform integrations, covering both physical distribution agreements and digital API partnerships.",
                  "complexity_score": 21,
                  "eval_gen": 2,
                  "subtasks": []
                }
              ]
            },
            {
              "task_id": "d694a9e573a0.0.2.3",
              "input": "Evaluate competitors' advertising campaigns, promotional offers, and digital marketing activities across traditional and emerging media",
              "complexity_score": 66,
              "eval_gen": 2,
              "subtasks": [
                {
                  "task_id": "d694a9e573a0.0.2.3.0",
                  "input": "Collect and evaluate advertising campaigns from competitors across traditional media channels (TV, radio, print, outdoor) to identify messaging themes, frequency, and channel effectiveness.",
                  "complexity_score": 65,
                  "eval_gen": 2,
                  "subtasks": [
                    {
                      "task_id": "d694a9e573a0.0.2.3.0.0",
                      "input": "Gather active and historical TV advertising campaigns from identified competitors, including air dates, time slots, and creative content.",
                      "complexity_score": 60,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.3.0.0.0",
                          "input": "Extract current running TV advertising campaigns from identified competitors using monitoring tools and databases.",
                          "complexity_score": 25,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.0.0.1",
                          "input": "Retrieve archived or past TV advertising campaigns from competitors using historical records and media databases.",
                          "complexity_score": 25,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.0.0.2",
                          "input": "Aggregate scheduling metadata including broadcast dates, time slots, and frequency for all identified campaigns.",
                          "complexity_score": 30,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.0.0.3",
                          "input": "Acquire creative assets such as video files, scripts, and ad variations associated with each campaign.",
                          "complexity_score": 35,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.3.0.1",
                      "input": "Capture audio ads, broadcast schedules, and station placements for competitors' radio advertising efforts.",
                      "complexity_score": 55,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.3.0.1.0",
                          "input": "Compile a list of relevant radio stations in the target market(s) and identify key competitors whose advertising efforts need to be monitored.",
                          "complexity_score": 15,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.0.1.1",
                          "input": "Systematically capture audio recordings of competitor advertisements aired on identified radio stations, ensuring clear audio quality and metadata tagging.",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.0.1.2",
                          "input": "Document the specific days, times, and frequencies when competitor ads are broadcast, creating a temporal map of advertising activity.",
                          "complexity_score": 15,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.0.1.3",
                          "input": "Track which advertisements are placed on which specific stations, noting any rotation patterns, daypart targeting, or station-specific creative variations.",
                          "complexity_score": 15,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.0.1.4",
                          "input": "Aggregate the captured audio files, schedule logs, and placement maps into a structured database or report for analysis.",
                          "complexity_score": 10,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.3.0.2",
                      "input": "Extract print ads from newspapers, magazines, and trade publications, noting publication dates and circulation metrics.",
                      "complexity_score": 55,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.3.0.2.0",
                          "input": "Gather physical or digital copies of the target newspapers, magazines, and trade publications. Organize them by title and prepare them for the extraction process (e.g., stacking physical copies, opening digital files).",
                          "complexity_score": 15,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.0.2.1",
                          "input": "Systematically review each page of the prepared publications to visually identify and mark or isolate print advertisements. This involves distinguishing ads from editorial content.",
                          "complexity_score": 25,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.0.2.2",
                          "input": "For each publication from which ads are extracted, record the publication's name, issue date, and relevant circulation metrics (e.g., print run, audited circulation figures).",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.0.2.3",
                          "input": "For each identified ad, record its content (e.g., via scanning, photographing, or copying) and associate it with the metadata of its source publication. Create a structured catalog entry.",
                          "complexity_score": 30,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.0.2.4",
                          "input": "Compile all extracted ad records and their associated publication metadata into a final, organized dataset (e.g., a database, spreadsheet, or digital archive). Perform a basic check for completeness and accuracy.",
                          "complexity_score": 10,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.3.0.3",
                      "input": "Document billboards, transit ads, and location-based outdoor placements with geographic coverage and frequency data.",
                      "complexity_score": 60,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.3.0.3.0",
                          "input": "Collect and record geographic coverage metrics and display frequency data for all billboard locations in the campaign.",
                          "complexity_score": 42,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.0.3.1",
                          "input": "Capture geographic distribution details and frequency metrics for all transit-based advertising locations including bus stops, train stations, and subway platforms.",
                          "complexity_score": 45,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.0.3.2",
                          "input": "Compile geographic coverage information and display frequency statistics for all location-targeted outdoor advertising placements including digital kiosks, street furniture, and targeted billboards.",
                          "complexity_score": 48,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.3.0.4",
                      "input": "Perform cross-channel analysis to identify recurring messaging themes, frequency patterns, and relative channel effectiveness metrics.",
                      "complexity_score": 75,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.3.0.4.0",
                          "input": "Aggregate message content from all communication channels and perform thematic analysis to identify repeating patterns, topics, and linguistic structures",
                          "complexity_score": 70,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.0.2.3.0.4.0.0",
                              "input": "Retrieve message content from each communication channel (e.g., email, chat, social media) using respective APIs or data sources",
                              "complexity_score": 50,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.0.4.0.1",
                              "input": "Combine all collected messages into a normalized dataset format for analysis, resolving format inconsistencies and duplicates",
                              "complexity_score": 40,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.0.4.0.2",
                              "input": "Apply natural language processing techniques to identify recurring themes, topics, and linguistic patterns in the aggregated dataset",
                              "complexity_score": 60,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.0.4.1",
                          "input": "Quantify message transmission intervals, volume trends, and temporal clustering characteristics across each communication channel",
                          "complexity_score": 65,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.0.4.2",
                          "input": "Compare channel performance using engagement rates, conversion correlations, and audience retention metrics normalized against message volume",
                          "complexity_score": 75,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.0.2.3.0.4.2.0",
                              "input": "Calculate and standardize engagement rate metrics for each channel relative to message volume",
                              "complexity_score": 25,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.0.4.2.1",
                              "input": "Determine statistical relationships between message volume and conversion rates across channels",
                              "complexity_score": 30,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.0.4.2.2",
                              "input": "Measure audience retention patterns normalized against message volume per channel",
                              "complexity_score": 20,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "task_id": "d694a9e573a0.0.2.3.1",
                  "input": "Collect and evaluate advertising campaigns from competitors across emerging media channels (social media, streaming platforms, influencer partnerships) to identify innovative strategies and engagement tactics.",
                  "complexity_score": 68,
                  "eval_gen": 2,
                  "subtasks": [
                    {
                      "task_id": "d694a9e573a0.0.2.3.1.0",
                      "input": "Gather competitor campaign data from social media platforms and analyze creative approaches, engagement metrics, and audience targeting strategies.",
                      "complexity_score": 65,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.3.1.0.0",
                          "input": "Collect raw campaign data from specified social media platforms including content assets, posting schedules, and metadata",
                          "complexity_score": 30,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.1.0.1",
                          "input": "Identify patterns in visual elements, copywriting styles, and content formats across competitor campaigns",
                          "complexity_score": 25,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.1.0.2",
                          "input": "Quantify performance indicators including likes, shares, comments, and conversion rates",
                          "complexity_score": 25,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.1.0.3",
                          "input": "Map demographic segmentation, geographic targeting, and behavioral patterns in audience engagement",
                          "complexity_score": 25,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.3.1.1",
                      "input": "Identify competitor ad placements on streaming services, assess content formats, viewer interaction patterns, and platform-specific optimization techniques.",
                      "complexity_score": 65,
                      "eval_gen": 2,
                      "subtasks": []
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.3.1.2",
                      "input": "Map competitor collaborations with influencers, analyze partnership structures, content authenticity approaches, and audience conversion effectiveness.",
                      "complexity_score": 65,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.3.1.2.0",
                          "input": "Identify and document active partnerships between competitors and influencers across platforms, including collaboration frequency, content formats, and contractual arrangements.",
                          "complexity_score": 50,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.1.2.1",
                          "input": "Evaluate the organizational frameworks of identified collaborations, including revenue-sharing models, content ownership terms, and performance metrics defined in agreements.",
                          "complexity_score": 55,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.1.2.2",
                          "input": "Examine strategies competitors use to maintain perceived authenticity in influencer content, such as disclosure practices, creative control mechanisms, and audience trust indicators.",
                          "complexity_score": 52,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.1.2.3",
                          "input": "Quantify the impact of influencer collaborations on audience behavior, including engagement rates, lead generation, and sales conversion metrics across different partnership models.",
                          "complexity_score": 58,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.3.1.3",
                      "input": "Compare tactical patterns across all media channels to surface innovative ad formats, engagement drivers, and emerging market trends.",
                      "complexity_score": 70,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.3.1.3.0",
                          "input": "Collect and standardize raw performance metrics, ad creatives, audience engagement logs, and campaign metadata across digital, social, broadcast, and print channels",
                          "complexity_score": 65,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.1.3.1",
                          "input": "Apply machine learning models to detect recurring tactical patterns in ad formats, content cadence, audience targeting, and conversion pathways unique to each media channel",
                          "complexity_score": 72,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.1.3.2",
                          "input": "Correlate user interaction metrics (click-through rates, dwell time, shares) with specific tactical elements (visual motifs, CTAs, timing) across detected patterns",
                          "complexity_score": 68,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.1.3.3",
                          "input": "Compare pattern clusters and engagement mappings across channels to identify statistically significant overlaps, divergences, and channel-agnostic effectiveness indicators",
                          "complexity_score": 75,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.1.3.4",
                          "input": "Synthesize analysis outputs to isolate emerging cross-channel trend trajectories, high-performing format mutations, and underutilized engagement mechanics with market differentiation potential",
                          "complexity_score": 70,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "task_id": "d694a9e573a0.0.2.3.2",
                  "input": "Identify and assess the structure, timing, and value proposition of competitors' promotional offers (discounts, bundles, loyalty programs) across all customer touchpoints.",
                  "complexity_score": 63,
                  "eval_gen": 2,
                  "subtasks": [
                    {
                      "task_id": "d694a9e573a0.0.2.3.2.0",
                      "input": "Gather information on competitors' promotional offers (discounts, bundles, loyalty programs) from all customer touchpoints including digital platforms, physical locations, and marketing channels.",
                      "complexity_score": 50,
                      "eval_gen": 2,
                      "subtasks": []
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.3.2.1",
                      "input": "Map the architectural components of identified promotions, including discount mechanics, bundle configurations, and loyalty program tiers across all touchpoints.",
                      "complexity_score": 45,
                      "eval_gen": 2,
                      "subtasks": []
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.3.2.2",
                      "input": "Determine the temporal aspects of competitor promotions, including campaign duration, frequency, seasonality alignment, and touchpoint-specific timing strategies.",
                      "complexity_score": 40,
                      "eval_gen": 2,
                      "subtasks": []
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.3.2.3",
                      "input": "Quantify and qualify the perceived value of competitor offers through price comparisons, benefit analysis, and customer engagement metrics across all channels.",
                      "complexity_score": 55,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.3.2.3.0",
                          "input": "Gather structured and unstructured data on competitor pricing, product/service features, promotional offers, and customer engagement from all relevant channels (e.g., websites, social media, market reports, direct customer feedback).",
                          "complexity_score": 25,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.2.3.1",
                          "input": "Analyze collected pricing data to quantify competitor price points, discounts, bundling strategies, and perceived value-for-money relative to our own offerings.",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.2.3.2",
                          "input": "Qualitatively and quantitatively assess the benefits, features, and unique selling propositions of competitor offers to understand their perceived value beyond price.",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.2.3.3",
                          "input": "Evaluate metrics such as social media sentiment, review ratings, market share movements, and customer survey data to gauge how the market perceives and engages with competitor offers.",
                          "complexity_score": 25,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.2.3.4",
                          "input": "Integrate the results from price comparison, benefit analysis, and engagement metrics to produce a consolidated report quantifying and qualifying the overall perceived value of competitor offers.",
                          "complexity_score": 30,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "task_id": "d694a9e573a0.0.2.3.3",
                  "input": "Examine competitors' digital marketing efforts on established platforms (websites, email marketing, SEO/SEM) to determine content strategies, conversion tactics, and technical execution.",
                  "complexity_score": 67,
                  "eval_gen": 2,
                  "subtasks": [
                    {
                      "task_id": "d694a9e573a0.0.2.3.3.0",
                      "input": "Examine competitors' websites to identify content strategies (e.g., blog posts, multimedia), conversion tactics (e.g., CTAs, landing pages), and technical execution (e.g., site speed, mobile responsiveness).",
                      "complexity_score": 65,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.3.3.0.0",
                          "input": "Identify and document content types (blogs, multimedia) used by competitors, including frequency, quality, and engagement tactics.",
                          "complexity_score": 60,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.3.0.1",
                          "input": "Map competitors' conversion elements such as CTA placement, landing page design, and funnel structures.",
                          "complexity_score": 65,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.0.2.3.3.0.1.0",
                              "input": "Identify and document the positioning, visual prominence, and contextual relevance of call-to-action elements across competitors' web pages.",
                              "complexity_score": 50,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.3.0.1.1",
                              "input": "Assess competitors' landing pages for layout hierarchy, visual engagement, content clarity, and alignment of design elements with conversion goals.",
                              "complexity_score": 55,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.3.0.1.2",
                              "input": "Trace and document the step-by-step user journey across competitors' conversion funnels, including entry points, intermediate steps, and final conversion triggers.",
                              "complexity_score": 60,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.3.0.2",
                          "input": "Measure competitors' site speed, mobile responsiveness, and other technical performance indicators.",
                          "complexity_score": 70,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.3.3.1",
                      "input": "Evaluate competitors' email campaigns to determine content strategies (e.g., newsletter themes), conversion tactics (e.g., promotional offers), and technical execution (e.g., automation workflows, deliverability tactics).",
                      "complexity_score": 67,
                      "eval_gen": 2,
                      "subtasks": []
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.3.3.2",
                      "input": "Investigate competitors' search engine optimization and paid search strategies, including content optimization techniques, keyword targeting, ad copy effectiveness, and technical SEO implementation.",
                      "complexity_score": 69,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.3.3.2.0",
                          "input": "Evaluate content structure, quality metrics, and engagement patterns of top competitors' organic content across target keywords and topics",
                          "complexity_score": 72,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.0.2.3.3.2.0.0",
                              "input": "Gather organic content samples from top competitors for specified keywords/topics",
                              "complexity_score": 20,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.3.2.0.1",
                              "input": "Identify common structural elements (headings, formatting, multimedia placement) in collected content",
                              "complexity_score": 25,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.3.2.0.2",
                              "input": "Evaluate readability scores, originality, factual accuracy, and technical quality of content samples",
                              "complexity_score": 25,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.3.2.0.3",
                              "input": "Analyze social shares, comments, backlinks, and dwell time metrics for competitor content",
                              "complexity_score": 22,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.3.2.1",
                          "input": "Identify primary/secondary keywords, analyze keyword density patterns, and map semantic relationships in competitor content",
                          "complexity_score": 75,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.0.2.3.3.2.1.0",
                              "input": "Identify primary and secondary keywords from competitor content using NLP techniques and frequency analysis",
                              "complexity_score": 25,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.3.2.1.1",
                              "input": "Calculate keyword frequency distribution patterns across content segments to identify strategic placement",
                              "complexity_score": 25,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.3.2.1.2",
                              "input": "Establish contextual relationships between keywords through co-occurrence analysis and topic modeling",
                              "complexity_score": 30,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.3.2.2",
                          "input": "Compare click-through rates, conversion metrics, and creative elements across competitor paid search campaigns",
                          "complexity_score": 68,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.3.2.3",
                          "input": "Audit site speed metrics, meta tag configurations, structured data usage, and mobile optimization features",
                          "complexity_score": 78,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.0.2.3.3.2.3.0",
                              "input": "Measure and evaluate core performance metrics including load time, time-to-first-byte, and page size across key site pages",
                              "complexity_score": 80,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.3.2.3.1",
                              "input": "Examine meta tags for SEO compliance, including title tags, description tags, and Open Graph implementations",
                              "complexity_score": 75,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.3.2.3.2",
                              "input": "Check implementation of schema markup and JSON-LD for rich snippets and semantic search optimization",
                              "complexity_score": 78,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.3.2.3.3",
                              "input": "Evaluate responsive design elements, viewport configurations, and mobile-specific performance optimizations",
                              "complexity_score": 77,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "task_id": "d694a9e573a0.0.2.3.4",
                  "input": "Investigate competitors' digital marketing experiments on new platforms (AI-driven tools, metaverse environments, short-form video apps) to uncover early adoption patterns and creative approaches.",
                  "complexity_score": 70,
                  "eval_gen": 2,
                  "subtasks": [
                    {
                      "task_id": "d694a9e573a0.0.2.3.4.0",
                      "input": "Identify and document competitors' use cases, implementation strategies, and performance metrics for AI-powered marketing tools across multiple industries.",
                      "complexity_score": 65,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.3.4.0.0",
                          "input": "Identify key competitors in AI-powered marketing tools across industries through market analysis and industry reports",
                          "complexity_score": 70,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.0.2.3.4.0.0.0",
                              "input": "Gather raw market data from multiple sources including industry surveys, vendor listings, and customer reviews to identify active AI-powered marketing platforms across various industries.",
                              "complexity_score": 65,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.4.0.0.1",
                              "input": "Systematically analyze third-party industry reports from research firms (e.g., Gartner, Forrester) to identify vendors positioned as key players in AI-driven marketing technology segments.",
                              "complexity_score": 70,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.4.0.0.2",
                              "input": "Compare and reconcile identified competitors from market data collection with those highlighted in industry reports to establish a consolidated list of key market participants.",
                              "complexity_score": 75,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.4.0.1",
                          "input": "Extract and document specific use cases implemented by competitors in different industry verticals",
                          "complexity_score": 65,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.0.2.3.4.0.1.0",
                              "input": "Research and select relevant competitors for detailed analysis based on market presence and industry relevance.",
                              "complexity_score": 60,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.4.0.1.1",
                              "input": "Collect and parse implementation details from each selected competitor to identify specific use cases.",
                              "complexity_score": 70,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.4.0.1.2",
                              "input": "Classify the extracted use cases according to their respective industry verticals and application contexts.",
                              "complexity_score": 50,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.4.0.1.3",
                              "input": "Structure and record the categorized use cases into a comprehensive report with implementation examples and industry mappings.",
                              "complexity_score": 40,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.4.0.2",
                          "input": "Document technical approaches and AI methodologies used by competitors for marketing tool deployment",
                          "complexity_score": 75,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.0.2.3.4.0.2.0",
                              "input": "Research and catalog active competitors operating in the marketing automation tool market segment",
                              "complexity_score": 60,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.4.0.2.1",
                              "input": "Examine infrastructure design, deployment models, and system integration approaches used by identified competitors",
                              "complexity_score": 75,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.4.0.2.2",
                              "input": "Document machine learning frameworks, algorithm selection criteria, and data processing pipelines employed by competitor solutions",
                              "complexity_score": 80,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.4.0.2.3",
                              "input": "Structure findings into standardized format comparing technical approaches and AI methodologies across competitors",
                              "complexity_score": 70,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.4.0.3",
                          "input": "Compile quantitative performance data including accuracy rates, ROI metrics, and engagement statistics",
                          "complexity_score": 80,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.0.2.3.4.0.3.0",
                              "input": "Gather raw data on correct predictions or classifications versus total attempts from relevant systems. Calculate accuracy percentages for specified models, processes, or time periods.",
                              "complexity_score": 25,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.4.0.3.1",
                              "input": "Collect financial data on costs incurred and value generated (e.g., increased revenue, cost savings). Calculate Return on Investment (ROI) percentages or other financial efficiency ratios for the assessed initiatives.",
                              "complexity_score": 30,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.4.0.3.2",
                              "input": "Compile user interaction data such as session duration, click-through rates, feature usage frequency, and survey response rates from analytics platforms to form a comprehensive view of engagement.",
                              "complexity_score": 25,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.4.0.4",
                          "input": "Map patterns and differences in implementation approaches and success metrics across industries",
                          "complexity_score": 85,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.0.2.3.4.0.4.0",
                              "input": "Establish a standardized taxonomy for categorizing industries (e.g., manufacturing, healthcare, finance, retail, technology) to ensure consistent comparison across sectors. This includes defining industry boundaries, key characteristics, and relevant sub-sectors.",
                              "complexity_score": 25,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.4.0.4.1",
                              "input": "For each defined industry, research and document recurring patterns in how projects/initiatives are implemented. This includes typical methodologies (Agile, Waterfall, hybrid), team structures, technology adoption curves, and change management approaches.",
                              "complexity_score": 30,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.4.0.4.2",
                              "input": "Catalog and categorize the key performance indicators (KPIs), metrics, and measurement frameworks used to evaluate success within each industry. This includes financial metrics, operational metrics, customer satisfaction metrics, and industry-specific benchmarks.",
                              "complexity_score": 30,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.4.0.4.3",
                              "input": "Perform cross-industry analysis to identify similarities and differences in implementation approaches. Create comparative matrices or frameworks showing how patterns vary by industry characteristics (regulation, pace of change, capital intensity, etc.).",
                              "complexity_score": 35,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.4.0.4.4",
                              "input": "Develop a cohesive mapping framework or model that visually and conceptually represents the patterns, differences, and relationships between implementation approaches and success metrics across the analyzed industries.",
                              "complexity_score": 25,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.3.4.1",
                      "input": "Investigate virtual world campaigns including NFT integrations, avatar interactions, and spatial analytics across leading metaverse platforms.",
                      "complexity_score": 68,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.3.4.1.0",
                          "input": "Identify technical frameworks and APIs for integrating NFTs into virtual world campaigns, including minting processes, ownership verification, and asset interoperability across platforms.",
                          "complexity_score": 22,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.4.1.1",
                          "input": "Document user-avatar interaction patterns in campaigns, including gesture controls, customization APIs, and social engagement mechanics within metaverse environments.",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.4.1.2",
                          "input": "Assess tools and metrics for tracking user movement, dwell time, and spatial behavior in virtual campaigns, including heatmapping and engagement zone analysis.",
                          "complexity_score": 18,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.4.1.3",
                          "input": "Compare technical specifications, campaign deployment tools, and integration support across leading platforms like Decentraland, Roblox, and Unreal Engine-based environments.",
                          "complexity_score": 28,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.3.4.2",
                      "input": "Reverse-engineer viral patterns, content formats, and audience engagement mechanics in competitors' TikTok/Reels/YouTube Shorts campaigns.",
                      "complexity_score": 63,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.3.4.2.0",
                          "input": "Identify recurring visual/audio elements, timing structures, and trend-jacking strategies in top-performing competitor content across all platforms",
                          "complexity_score": 68,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.0.2.3.4.2.0.0",
                              "input": "Aggregate representative content samples from all platforms that meet performance thresholds (e.g., engagement metrics, reach, conversion rates) for analysis",
                              "complexity_score": 70,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.4.2.0.1",
                              "input": "Process collected content to isolate visual elements (color schemes, motion patterns, text overlays) and audio elements (sound effects, music, voice characteristics) using media analysis tools",
                              "complexity_score": 75,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.4.2.0.2",
                              "input": "Analyze content duration, pacing patterns, transition points, and synchronization between visual/audio elements across different platform formats",
                              "complexity_score": 80,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.4.2.0.3",
                              "input": "Detect recurring strategies for leveraging current trends including timing of adoption, platform-specific adaptations, and novelty factors",
                              "complexity_score": 85,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.4.2.0.4",
                              "input": "Correlate extracted elements to identify consistent patterns that maintain effectiveness across different platform algorithms and audience behaviors",
                              "complexity_score": 90,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.4.2.1",
                          "input": "Document platform-specific content architectures including aspect ratios, captioning styles, interaction prompts, and multimedia layering techniques",
                          "complexity_score": 62,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.0.2.3.4.2.1.0",
                              "input": "Document standard aspect ratios for different platforms (e.g., 1:1 for Instagram, 16:9 for YouTube Shorts), including responsive design considerations",
                              "complexity_score": 60,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.4.2.1.1",
                              "input": "Capture platform-specific captioning conventions including character limits, positioning, animation styles, and accessibility requirements",
                              "complexity_score": 65,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.4.2.1.2",
                              "input": "Identify platform-specific user interaction prompts including swipe gestures, tap targets, hover states, and micro-interactions",
                              "complexity_score": 70,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.4.2.1.3",
                              "input": "Document techniques for combining text, images, video, and audio across platforms including z-index hierarchies and temporal sequencing",
                              "complexity_score": 75,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.4.2.2",
                          "input": "Reverse-engineer call-to-action mechanics, community-building patterns, and algorithmic amplification signals embedded in competitor campaigns",
                          "complexity_score": 70,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.0.2.3.4.2.2.0",
                              "input": "Extract and analyze CTA types, triggers, placement, and frequency across competitor campaigns to identify effective mechanics.",
                              "complexity_score": 65,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.4.2.2.1",
                              "input": "Map engagement strategies, track growth metrics, and analyze interaction networks to identify community-building patterns.",
                              "complexity_score": 65,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.0.2.3.4.2.2.2",
                              "input": "Identify virality signals, platform-specific algorithms, and amplification triggers embedded in competitor campaigns.",
                              "complexity_score": 65,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.3.4.3",
                      "input": "Correlate findings across all platforms to identify emerging trends, resource allocation patterns, and creative execution frameworks.",
                      "complexity_score": 72,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.3.4.3.0",
                          "input": "Collect and standardize raw findings from all platforms into a unified dataset for correlation analysis",
                          "complexity_score": 18,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.4.3.1",
                          "input": "Analyze time-series data across platforms to detect statistically significant emerging trends",
                          "complexity_score": 22,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.4.3.2",
                          "input": "Cross-reference budget distribution, team assignments, and asset utilization metrics across platforms",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.3.4.3.3",
                          "input": "Isolate recurring methodological patterns in successful cross-platform campaigns and initiatives",
                          "complexity_score": 19,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "task_id": "d694a9e573a0.0.2.4",
              "input": "Quantify and visualize competitors' market share changes over time using historical sales data and industry reports",
              "complexity_score": 70,
              "eval_gen": 2,
              "subtasks": [
                {
                  "task_id": "d694a9e573a0.0.2.4.0",
                  "input": "Gather historical sales data from competitor sources, clean data format, and standardize metrics for analysis.",
                  "complexity_score": 60,
                  "eval_gen": 2,
                  "subtasks": [
                    {
                      "task_id": "d694a9e573a0.0.2.4.0.0",
                      "input": "Access external competitor databases and extract historical sales records in raw format.",
                      "complexity_score": 25,
                      "eval_gen": 2,
                      "subtasks": []
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.4.0.1",
                      "input": "Convert raw data into standardized schema with consistent field names, date formats, and currency units.",
                      "complexity_score": 20,
                      "eval_gen": 2,
                      "subtasks": []
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.4.0.2",
                      "input": "Transform sales metrics to common definitions (e.g., gross revenue vs. net revenue) for cross-source comparability.",
                      "complexity_score": 15,
                      "eval_gen": 2,
                      "subtasks": []
                    }
                  ]
                },
                {
                  "task_id": "d694a9e573a0.0.2.4.1",
                  "input": "Identify and extract relevant market share statistics and trends from published industry reports.",
                  "complexity_score": 50,
                  "eval_gen": 2,
                  "subtasks": []
                },
                {
                  "task_id": "d694a9e573a0.0.2.4.2",
                  "input": "Analyze the preprocessed sales data and extracted report metrics to compute market share changes across defined time intervals.",
                  "complexity_score": 65,
                  "eval_gen": 2,
                  "subtasks": [
                    {
                      "task_id": "d694a9e573a0.0.2.4.2.0",
                      "input": "Process preprocessed sales data to extract time-series metrics for each market segment, including total sales volume and revenue per interval.",
                      "complexity_score": 60,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.4.2.0.0",
                          "input": "Partition preprocessed sales data into distinct market segment groups based on predefined segmentation criteria",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.4.2.0.1",
                          "input": "Calculate total sales volume and revenue values for each time interval within every market segment group",
                          "complexity_score": 30,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.4.2.0.2",
                          "input": "Format and structure the aggregated time-series metrics into standardized output format for downstream consumption",
                          "complexity_score": 10,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.4.2.1",
                      "input": "Evaluate extracted report metrics to establish baseline market share distributions and historical trends for comparison.",
                      "complexity_score": 60,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.4.2.1.0",
                          "input": "Analyze extracted report metrics to calculate baseline market share distributions across relevant segments.",
                          "complexity_score": 40,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.4.2.1.1",
                          "input": "Analyze extracted report metrics over time to detect patterns and trends in market share changes.",
                          "complexity_score": 35,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.4.2.1.2",
                          "input": "Compare derived baseline distributions and identified trends against industry standards or competitor data for contextual analysis.",
                          "complexity_score": 25,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.4.2.2",
                      "input": "Compare analyzed sales data with report metrics to calculate interval-based market share changes, accounting for seasonal variations and outliers.",
                      "complexity_score": 70,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.4.2.2.0",
                          "input": "Normalize and temporally align analyzed sales data with report metrics to ensure comparable dimensions and intervals.",
                          "complexity_score": 15,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.4.2.2.1",
                          "input": "Apply seasonal decomposition techniques to isolate and normalize periodic fluctuations in sales patterns.",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.4.2.2.2",
                          "input": "Detect statistical outliers using interquartile range or z-score methods and apply data smoothing techniques.",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.4.2.2.3",
                          "input": "Compute delta values between consecutive time intervals using adjusted data to quantify market share shifts.",
                          "complexity_score": 15,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "task_id": "d694a9e573a0.0.2.4.3",
                  "input": "Create visual representations (e.g., line charts, heatmaps) to illustrate market share trends and changes over time.",
                  "complexity_score": 60,
                  "eval_gen": 2,
                  "subtasks": [
                    {
                      "task_id": "d694a9e573a0.0.2.4.3.0",
                      "input": "Clean, aggregate, and format market share data into time-series structures suitable for charting libraries",
                      "complexity_score": 65,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.4.3.0.0",
                          "input": "Process raw market share data to remove duplicates, handle missing values, and normalize data formats.",
                          "complexity_score": 30,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.4.3.0.1",
                          "input": "Aggregate cleaned market share data into specified time intervals (e.g., daily, monthly).",
                          "complexity_score": 25,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.4.3.0.2",
                          "input": "Transform aggregated data into structured formats compatible with charting libraries (e.g., JSON time-series objects).",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.4.3.1",
                      "input": "Determine optimal chart types (line/heatmap) based on data dimensionality and trend characteristics",
                      "complexity_score": 55,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.4.3.1.0",
                          "input": "Analyze the dataset to determine key dimensionality characteristics including number of variables, data types (categorical/continuous), cardinality of categorical variables, and temporal/spatial dimensions if present.",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.4.3.1.1",
                          "input": "Examine the data for temporal trends, seasonal patterns, correlations between variables, distribution shapes, and identify whether relationships are linear, non-linear, or cyclical.",
                          "complexity_score": 25,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.4.3.1.2",
                          "input": "Apply decision rules comparing data characteristics against line chart and heatmap requirements. Line charts require temporal/sequential data with clear trends; heatmaps require two-dimensional categorical data with intensity variations.",
                          "complexity_score": 30,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.4.3.1.3",
                          "input": "Make final determination between line chart and heatmap based on evaluation results, providing clear rationale linking data characteristics to chart selection.",
                          "complexity_score": 15,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.4.3.2",
                      "input": "Render visualizations using selected charting libraries with appropriate axis scaling and color schemes",
                      "complexity_score": 70,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.0.2.4.3.2.0",
                          "input": "Load and initialize the selected charting library with default configuration parameters to prepare for visualization rendering.",
                          "complexity_score": 15,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.4.3.2.1",
                          "input": "Determine and set appropriate axis scales and ranges based on the data characteristics and visualization type requirements.",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.4.3.2.2",
                          "input": "Assign and configure color palettes and gradients for data elements according to the selected design specifications.",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.0.2.4.3.2.3",
                          "input": "Execute the final rendering process using the configured charting library settings to generate the visualization output.",
                          "complexity_score": 35,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.0.2.4.3.3",
                      "input": "Verify chart accuracy against source data and ensure visual clarity meets reporting standards",
                      "complexity_score": 45,
                      "eval_gen": 2,
                      "subtasks": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "task_id": "d694a9e573a0.1",
      "input": "Create educational content assets (e.g., videos, infographics, articles) tailored to different platforms while maintaining consistent messaging.",
      "complexity_score": 75,
      "eval_gen": 2,
      "subtasks": [
        {
          "task_id": "d694a9e573a0.1.0",
          "input": "Define core messaging, target audience personas, and platform-specific adaptation guidelines to ensure consistency across all content formats.",
          "complexity_score": 70,
          "eval_gen": 2,
          "subtasks": [
            {
              "task_id": "d694a9e573a0.1.0.0",
              "input": "Establish key messages, value propositions, and tone guidelines that align with brand strategy and business objectives.",
              "complexity_score": 60,
              "eval_gen": 2,
              "subtasks": [
                {
                  "task_id": "d694a9e573a0.1.0.0.0",
                  "input": "Extract core elements from brand strategy and business objectives to establish alignment requirements for messaging and tone.",
                  "complexity_score": 50,
                  "eval_gen": 2,
                  "subtasks": []
                },
                {
                  "task_id": "d694a9e573a0.1.0.0.1",
                  "input": "Develop concise, impactful key messages that reflect the core elements identified in the brand strategy and business objectives.",
                  "complexity_score": 60,
                  "eval_gen": 2,
                  "subtasks": [
                    {
                      "task_id": "d694a9e573a0.1.0.0.1.0",
                      "input": "Analyze documented brand strategy elements and business objectives to identify core messaging pillars.",
                      "complexity_score": 20,
                      "eval_gen": 2,
                      "subtasks": []
                    },
                    {
                      "task_id": "d694a9e573a0.1.0.0.1.1",
                      "input": "Generate draft message concepts aligned with strategic pillars while maintaining brand voice and audience relevance.",
                      "complexity_score": 40,
                      "eval_gen": 2,
                      "subtasks": []
                    },
                    {
                      "task_id": "d694a9e573a0.1.0.0.1.2",
                      "input": "Assess message effectiveness through stakeholder feedback and refine for clarity, impact, and strategic alignment.",
                      "complexity_score": 50,
                      "eval_gen": 2,
                      "subtasks": []
                    },
                    {
                      "task_id": "d694a9e573a0.1.0.0.1.3",
                      "input": "Secure formal endorsement from stakeholders and prepare final message set for implementation.",
                      "complexity_score": 30,
                      "eval_gen": 2,
                      "subtasks": []
                    }
                  ]
                },
                {
                  "task_id": "d694a9e573a0.1.0.0.2",
                  "input": "Create compelling value propositions that align with the analyzed brand strategy and business objectives, emphasizing unique benefits.",
                  "complexity_score": 60,
                  "eval_gen": 2,
                  "subtasks": [
                    {
                      "task_id": "d694a9e573a0.1.0.0.2.0",
                      "input": "Identify core strategic themes and business objectives from existing brand analysis documentation to establish foundational elements for value proposition development",
                      "complexity_score": 50,
                      "eval_gen": 2,
                      "subtasks": []
                    },
                    {
                      "task_id": "d694a9e573a0.1.0.0.2.1",
                      "input": "Systematically identify and prioritize unique product/service benefits that create competitive advantage based on market research and capability analysis",
                      "complexity_score": 55,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.1.0.0.2.1.0",
                          "input": "Analyze gathered market research data to identify customer needs, competitor offerings, and market gaps. Synthesize findings into a structured report highlighting potential opportunity areas.",
                          "complexity_score": 25,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.1.0.0.2.1.1",
                          "input": "Evaluate internal strengths, resources, and core competencies. Map current capabilities against potential market opportunities identified in research.",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.1.0.0.2.1.2",
                          "input": "Brainstorm and formulate specific, unique product/service benefit propositions by cross-referencing market opportunities with internal capabilities.",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.1.0.0.2.1.3",
                          "input": "Evaluate generated benefit hypotheses against defined criteria (e.g., strategic alignment, feasibility, market impact, defensibility) to score and rank them.",
                          "complexity_score": 15,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.1.0.0.2.1.4",
                          "input": "Document the prioritized list of unique benefits, the rationale for their selection, and the analysis linking them to market research and capability insights.",
                          "complexity_score": 10,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.1.0.0.2.2",
                      "input": "Combine strategic themes with prioritized benefits to create compelling, differentiated value propositions aligned with business objectives and brand positioning",
                      "complexity_score": 55,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.1.0.0.2.2.0",
                          "input": "Review and interpret strategic themes to extract core messages, competitive advantages, and market positioning elements that can inform value proposition creation.",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.1.0.0.2.2.1",
                          "input": "Connect each prioritized benefit to specific customer pain points, desires, or requirements to ensure relevance and impact in the value proposition.",
                          "complexity_score": 18,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.1.0.0.2.2.2",
                          "input": "Create initial combinations of strategic themes with prioritized benefits to generate raw value proposition concepts.",
                          "complexity_score": 22,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.1.0.0.2.2.3",
                          "input": "Evaluate synthesized combinations against competitive landscape and unique capabilities to identify truly differentiated value propositions.",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.1.0.0.2.2.4",
                          "input": "Ensure each value proposition candidate supports key business goals such as revenue targets, market share growth, or strategic initiatives.",
                          "complexity_score": 15,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.1.0.0.2.2.5",
                          "input": "Refine value propositions to align with brand voice, personality, and positioning guidelines to ensure consistency across communications.",
                          "complexity_score": 18,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.1.0.0.2.2.6",
                          "input": "Transform aligned value propositions into compelling narratives with clear customer benefits, differentiation points, and emotional appeal.",
                          "complexity_score": 22,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.1.0.0.2.2.7",
                          "input": "Review final value propositions for internal consistency, logical flow, and alignment across all input dimensions.",
                          "complexity_score": 12,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "task_id": "d694a9e573a0.1.0.0.3",
                  "input": "Determine tone and style guidelines that reflect the brand's personality and resonate with target audiences while aligning with business goals.",
                  "complexity_score": 55,
                  "eval_gen": 2,
                  "subtasks": [
                    {
                      "task_id": "d694a9e573a0.1.0.0.3.0",
                      "input": "Review existing brand documentation, mission statements, and value propositions to extract and define the core personality traits and values that must be reflected in the communication style.",
                      "complexity_score": 20,
                      "eval_gen": 2,
                      "subtasks": []
                    },
                    {
                      "task_id": "d694a9e573a0.1.0.0.3.1",
                      "input": "Research and analyze the target audience segments to understand their language preferences, communication channels, and the tone that resonates most effectively with each segment.",
                      "complexity_score": 25,
                      "eval_gen": 2,
                      "subtasks": []
                    },
                    {
                      "task_id": "d694a9e573a0.1.0.0.3.2",
                      "input": "Consult business strategy documents and stakeholders to identify key business goals (e.g., market positioning, conversion targets, brand awareness) that the tone and style must support.",
                      "complexity_score": 15,
                      "eval_gen": 2,
                      "subtasks": []
                    },
                    {
                      "task_id": "d694a9e573a0.1.0.0.3.3",
                      "input": "Integrate insights from brand personality, audience preferences, and business goals to draft a coherent set of tone and style guidelines, including voice descriptors, do's/don'ts, and usage examples.",
                      "complexity_score": 25,
                      "eval_gen": 2,
                      "subtasks": []
                    },
                    {
                      "task_id": "d694a9e573a0.1.0.0.3.4",
                      "input": "Present the draft guidelines to key stakeholders (brand, marketing, leadership) for feedback, make necessary revisions, and produce the final, approved tone and style guide document.",
                      "complexity_score": 20,
                      "eval_gen": 2,
                      "subtasks": []
                    }
                  ]
                }
              ]
            },
            {
              "task_id": "d694a9e573a0.1.0.1",
              "input": "Create detailed audience personas based on market research, user behavior data, and demographic analysis.",
              "complexity_score": 55,
              "eval_gen": 2,
              "subtasks": [
                {
                  "task_id": "d694a9e573a0.1.0.1.0",
                  "input": "Review and synthesize findings from market research reports, competitive analysis, and industry trends to identify key audience segments and their motivations.",
                  "complexity_score": 25,
                  "eval_gen": 2,
                  "subtasks": []
                },
                {
                  "task_id": "d694a9e573a0.1.0.1.1",
                  "input": "Analyze quantitative and qualitative user behavior data (e.g., analytics, session recordings, surveys) to understand patterns, pain points, and user goals.",
                  "complexity_score": 30,
                  "eval_gen": 2,
                  "subtasks": []
                },
                {
                  "task_id": "d694a9e573a0.1.0.1.2",
                  "input": "Examine demographic data (age, location, income, education, etc.) to identify statistical patterns and correlations relevant to audience segmentation.",
                  "complexity_score": 20,
                  "eval_gen": 2,
                  "subtasks": []
                },
                {
                  "task_id": "d694a9e573a0.1.0.1.3",
                  "input": "Combine insights from all three data sources to define distinct persona groups, assigning each group demographic traits, behavioral patterns, goals, and challenges.",
                  "complexity_score": 35,
                  "eval_gen": 2,
                  "subtasks": []
                },
                {
                  "task_id": "d694a9e573a0.1.0.1.4",
                  "input": "Format each synthesized persona into a detailed document/profile including name, photo, background, quotes, scenarios, and specific attributes for design and marketing use.",
                  "complexity_score": 25,
                  "eval_gen": 2,
                  "subtasks": []
                }
              ]
            },
            {
              "task_id": "d694a9e573a0.1.0.2",
              "input": "Define adaptation rules for maintaining consistency across platforms while optimizing for each medium's unique requirements.",
              "complexity_score": 55,
              "eval_gen": 2,
              "subtasks": [
                {
                  "task_id": "d694a9e573a0.1.0.2.0",
                  "input": "Define the foundational, non-negotiable elements that must remain identical across all platforms (e.g., brand voice, key value propositions, logo usage, color palette core, primary CTAs). This creates the consistent anchor.",
                  "complexity_score": 30,
                  "eval_gen": 2,
                  "subtasks": []
                },
                {
                  "task_id": "d694a9e573a0.1.0.2.1",
                  "input": "For each target medium/platform (e.g., Twitter, blog, email, mobile app notification), document its technical limits (character count, image specs), user intent (discovery vs. deep read), and interaction patterns (swipe, click, scroll).",
                  "complexity_score": 40,
                  "eval_gen": 2,
                  "subtasks": []
                },
                {
                  "task_id": "d694a9e573a0.1.0.2.2",
                  "input": "Create specific rules for transforming core content to fit each medium's requirements while preserving the core message. Examples: 'Blog post thesis -> Twitter thread hook structure,' 'Detailed report -> Instagram carousel summary with data visualization specs.'",
                  "complexity_score": 50,
                  "eval_gen": 2,
                  "subtasks": []
                },
                {
                  "task_id": "d694a9e573a0.1.0.2.3",
                  "input": "Define rules for how assets relate across platforms (e.g., 'The YouTube video description must link to the full blog post,' 'The Instagram post must use the same hero image crop as the newsletter header'). Ensues cohesive user journeys.",
                  "complexity_score": 35,
                  "eval_gen": 2,
                  "subtasks": []
                },
                {
                  "task_id": "d694a9e573a0.1.0.2.4",
                  "input": "Define the metrics and review processes to audit both consistency (e.g., brand sentiment alignment score) and platform-specific performance (e.g., engagement rate per medium) to validate the adaptation rules.",
                  "complexity_score": 25,
                  "eval_gen": 2,
                  "subtasks": []
                }
              ]
            }
          ]
        },
        {
          "task_id": "d694a9e573a0.1.1",
          "input": "Create platform-optimized assets including video editing for YouTube/TikTok, visual design for LinkedIn/Instagram, and SEO-optimized writing for blogs/websites.",
          "complexity_score": 85,
          "eval_gen": 2,
          "subtasks": [
            {
              "task_id": "d694a9e573a0.1.1.0",
              "input": "Create and edit video assets tailored for YouTube (longer form, high production) and TikTok (short form, high engagement). Includes scripting, filming, editing, adding graphics/effects, and optimizing for each platform's format and audience.",
              "complexity_score": 70,
              "eval_gen": 2,
              "subtasks": [
                {
                  "task_id": "d694a9e573a0.1.1.0.0",
                  "input": "Script, film, edit, add graphics/effects, and optimize a longer-form video tailored for YouTube's high production standards and audience engagement patterns, including chapter markers, detailed descriptions, and SEO optimization.",
                  "complexity_score": 62,
                  "eval_gen": 2,
                  "subtasks": [
                    {
                      "task_id": "d694a9e573a0.1.1.0.0.0",
                      "input": "Create a detailed script aligned with YouTube audience engagement patterns, including timing markers for pacing and content segmentation.",
                      "complexity_score": 60,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.1.1.0.0.0.0",
                          "input": "Analyze current trends in audience retention metrics, optimal video structure patterns, and content segmentation benchmarks for YouTube platforms",
                          "complexity_score": 70,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.0.0.0",
                              "input": "Extract and evaluate recent changes in audience retention metrics across YouTube's platform, including watch time decay curves, drop-off points, and engagement patterns.",
                              "complexity_score": 70,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.0.0.1",
                              "input": "Identify emerging best practices in video composition, including intro hooks, pacing cadence, segment transitions, and call-to-action placements correlated with high retention.",
                              "complexity_score": 70,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.0.0.2",
                              "input": "Compare current content categorization standards against performance metrics to determine effective segmentation strategies for audience targeting and retention optimization.",
                              "complexity_score": 70,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        },
                        {
                          "task_id": "d694a9e573a0.1.1.0.0.0.1",
                          "input": "Create base script outline with hook placement, topic transitions, and engagement triggers aligned with pattern analysis",
                          "complexity_score": 75,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.0.1.0",
                              "input": "Incorporate pattern analysis findings into script structure requirements",
                              "complexity_score": 20,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.0.1.1",
                              "input": "Design strategic hook placement points based on pattern analysis insights",
                              "complexity_score": 15,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.0.1.2",
                              "input": "Develop transition logic between topics maintaining pattern consistency",
                              "complexity_score": 15,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.0.1.3",
                              "input": "Map engagement triggers to script segments using pattern analysis data",
                              "complexity_score": 15,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.0.1.4",
                              "input": "Integrate all components into a cohesive script outline structure",
                              "complexity_score": 20,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        },
                        {
                          "task_id": "d694a9e573a0.1.1.0.0.0.2",
                          "input": "Add precise timestamp indicators for pacing optimization based on content density and audience attention curve modeling",
                          "complexity_score": 65,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.0.2.0",
                              "input": "Calculate content density scores for each media segment using linguistic complexity and visual information density parameters",
                              "complexity_score": 60,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.0.2.1",
                              "input": "Generate attention curve profiles based on historical engagement data and cognitive processing patterns for similar content types",
                              "complexity_score": 65,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.0.2.2",
                              "input": "Calculate optimal timestamp placements by correlating content density metrics with attention curve valleys and peaks",
                              "complexity_score": 70,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        },
                        {
                          "task_id": "d694a9e573a0.1.1.0.0.0.3",
                          "input": "Define modular content segments with clear entry/exit points for adaptive viewing patterns and playlist optimization",
                          "complexity_score": 70,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.0.3.0",
                              "input": "Identify logical breakpoints in content based on thematic coherence, user engagement metrics, and technical constraints",
                              "complexity_score": 55,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.0.3.1",
                              "input": "Establish technical and experiential requirements for segment transitions including metadata tagging and continuity markers",
                              "complexity_score": 58,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.0.3.2",
                              "input": "Create rulesets for dynamic segment ordering based on user preferences, device capabilities, and contextual factors",
                              "complexity_score": 60,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.0.3.3",
                              "input": "Define interface requirements and dependency boundaries to ensure segments function independently while maintaining compatibility",
                              "complexity_score": 57,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.0.3.4",
                              "input": "Test segment architecture against playlist optimization metrics including load times, engagement retention, and format adaptability",
                              "complexity_score": 59,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        },
                        {
                          "task_id": "d694a9e573a0.1.1.0.0.0.4",
                          "input": "Review script flow against engagement metrics benchmarks and refine timing/content balance for maximum retention",
                          "complexity_score": 80,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.0.4.0",
                              "input": "Gather and organize relevant engagement metrics benchmarks (e.g., attention curves, drop-off points, interaction rates) that will serve as comparison standards for the script flow analysis.",
                              "complexity_score": 25,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.0.4.1",
                              "input": "Break down the script into sequential segments (intro, key points, transitions, conclusion) and map each segment to its corresponding timing within the total runtime.",
                              "complexity_score": 30,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.0.4.2",
                              "input": "Analyze how the script's pacing (placement of key messages, transitions, pauses) aligns or conflicts with the engagement benchmark curves to identify potential retention risks.",
                              "complexity_score": 40,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.0.4.3",
                              "input": "Evaluate the amount and complexity of information presented in each script segment relative to benchmark recommendations for optimal cognitive load and retention.",
                              "complexity_score": 35,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.0.4.4",
                              "input": "Synthesize findings from the comparative analysis to produce specific recommendations for adjusting timing (pacing, pauses) and content (simplification, reinforcement) to improve retention.",
                              "complexity_score": 45,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.0.4.5",
                              "input": "Record the specific script changes decided upon, linking each change to the engagement metric evidence that supports it, creating an audit trail for the refinement process.",
                              "complexity_score": 20,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.1.1.0.0.1",
                      "input": "Capture high-quality video footage following production standards, ensuring proper lighting, audio, and camera work.",
                      "complexity_score": 70,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.1.1.0.0.1.0",
                          "input": "Position and adjust lighting equipment to achieve even coverage, proper color temperature, and shadow control according to production standards.",
                          "complexity_score": 65,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.1.0.0",
                              "input": "Strategically place lights at calculated positions to ensure uniform illumination across the target area while maintaining safe rigging practices",
                              "complexity_score": 70,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.1.0.1",
                              "input": "Modify light output using color correction gels or digital temperature controls to match the required Kelvin rating for the production",
                              "complexity_score": 60,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.1.0.2",
                              "input": "Adjust light angles, diffusion filters, and reflectors to manage shadow intensity and directionality according to creative specifications",
                              "complexity_score": 65,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.1.0.3",
                              "input": "Measure lux levels, color accuracy, and shadow ratios using calibrated instruments to confirm adherence to production technical standards",
                              "complexity_score": 50,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        },
                        {
                          "task_id": "d694a9e573a0.1.1.0.0.1.1",
                          "input": "Deploy microphones, set input levels, and monitor audio quality to ensure clear dialogue and minimal ambient noise during recording.",
                          "complexity_score": 68,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.1.1.0",
                              "input": "Position and install microphones at optimal locations to capture dialogue while minimizing ambient noise interference.",
                              "complexity_score": 25,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.1.1.1",
                              "input": "Adjust microphone input gain settings to achieve optimal signal-to-noise ratio for clear dialogue reproduction.",
                              "complexity_score": 30,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.1.1.2",
                              "input": "Continuously analyze audio feed during recording to verify dialogue clarity and ambient noise suppression meets quality standards.",
                              "complexity_score": 43,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        },
                        {
                          "task_id": "d694a9e573a0.1.1.0.0.1.2",
                          "input": "Frame shots, adjust focus/zoom, and execute camera movements while maintaining exposure and composition standards during footage capture.",
                          "complexity_score": 72,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.1.2.0",
                              "input": "Frame shots according to predefined composition standards while monitoring scene dynamics",
                              "complexity_score": 60,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.1.2.1",
                              "input": "Continuously adjust focus and zoom parameters during footage capture to maintain subject clarity",
                              "complexity_score": 65,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.1.2.2",
                              "input": "Implement planned camera movements with precise timing and trajectory control",
                              "complexity_score": 63,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.1.2.3",
                              "input": "Monitor and adjust exposure parameters in real-time to maintain visual consistency",
                              "complexity_score": 58,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        },
                        {
                          "task_id": "d694a9e573a0.1.1.0.0.1.3",
                          "input": "Synchronize lighting, audio, and camera systems through test shots and real-time adjustments to ensure holistic production quality.",
                          "complexity_score": 75,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.1.3.0",
                              "input": "Capture test shots to analyze synchronization alignment between lighting, audio, and camera systems",
                              "complexity_score": 60,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.1.3.1",
                              "input": "Modify lighting parameters based on test shot analysis to achieve visual consistency",
                              "complexity_score": 55,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.1.3.2",
                              "input": "Calibrate audio levels and timing relative to visual elements from test shots",
                              "complexity_score": 55,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.1.3.3",
                              "input": "Optimize camera settings (framing, focus, exposure) based on synchronization feedback",
                              "complexity_score": 55,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.0.1.3.4",
                              "input": "Confirm synchronized operation across all systems meets production standards",
                              "complexity_score": 50,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.1.1.0.0.2",
                      "input": "Assemble raw footage into a cohesive narrative with transitions, pacing adjustments, and basic color correction.",
                      "complexity_score": 75,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.1.1.0.0.2.0",
                          "input": "Identify key clips, arrange in chronological/story order, and establish base timeline structure",
                          "complexity_score": 25,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.1.1.0.0.2.1",
                          "input": "Implement crossfades, cuts, and visual transitions between sequential clips according to pacing requirements",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.1.1.0.0.2.2",
                          "input": "Modify clip durations, add/remove pauses, and synchronize timing to maintain narrative flow",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.1.1.0.0.2.3",
                          "input": "Perform white balance adjustments, exposure correction, and color grading across all clips",
                          "complexity_score": 10,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.1.1.0.0.3",
                      "input": "Design and implement motion graphics, animations, and visual effects to enhance viewer engagement.",
                      "complexity_score": 80,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.1.1.0.0.3.0",
                          "input": "Establish the overarching visual theme, motion language, and aesthetic principles for the motion graphics and effects. This includes defining color palettes, typography animation styles, iconography, and the emotional tone to ensure consistency and alignment with brand/engagement goals.",
                          "complexity_score": 25,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.1.1.0.0.3.1",
                          "input": "Create visual storyboards and animatics for primary animated sequences and VFX shots. This involves sketching keyframes, planning transitions, timing, and narrative flow to visualize how motion will enhance specific engagement points (e.g., introductions, data highlights, transitions).",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.1.1.0.0.3.2",
                          "input": "Design and produce all necessary static and dynamic visual assets required for animation and effects. This includes creating vector graphics, layered Photoshop/Illustrator files, 3D models, texture maps, and any required video or image plates.",
                          "complexity_score": 15,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.1.1.0.0.3.3",
                          "input": "Implement the primary motion graphics animations using software like After Effects or similar. This task focuses on bringing the storyboarded concepts to life through keyframing, easing, and basic compositing to create the main animated segments.",
                          "complexity_score": 30,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.1.1.0.0.3.4",
                          "input": "Add and composite visual effects (VFX) such as particle systems, lighting effects, glitches, distortions, or simulated phenomena. This layer enhances the base animations to increase visual impact and viewer engagement.",
                          "complexity_score": 25,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.1.1.0.0.3.5",
                          "input": "Composite all animated sequences and effects into the final video timeline, perform final color correction/grading, render in the required formats and resolutions, and prepare deliverables for the target platform(s) ensuring technical specifications are met.",
                          "complexity_score": 20,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.1.1.0.0.4",
                      "input": "Implement chapter markers, craft detailed descriptions, and apply SEO strategies for discoverability and audience retention.",
                      "complexity_score": 50,
                      "eval_gen": 2,
                      "subtasks": []
                    }
                  ]
                },
                {
                  "task_id": "d694a9e573a0.1.1.0.1",
                  "input": "Script, film, edit, add graphics/effects, and optimize a short-form video tailored for TikTok's high engagement format, including vertical framing, trending audio integration, quick cuts, and platform-specific visual effects.",
                  "complexity_score": 65,
                  "eval_gen": 2,
                  "subtasks": [
                    {
                      "task_id": "d694a9e573a0.1.1.0.1.0",
                      "input": "Develop a concise script optimized for TikTok's engagement patterns, including hook placement, scene breakdowns, and text overlay planning.",
                      "complexity_score": 60,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.1.1.0.1.0.0",
                          "input": "Define the opening hook's content, timing, and emotional trigger to maximize viewer retention within TikTok's 1-2 second attention window",
                          "complexity_score": 40,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.1.1.0.1.0.1",
                          "input": "Structure the script into 3-5 rapid-fire scenes with clear visual transitions, ensuring each scene advances the narrative while maintaining platform-specific pacing",
                          "complexity_score": 50,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.1.1.0.1.0.2",
                          "input": "Design strategic text placements for key moments, balancing readability with visual impact to reinforce audio/visual messaging without overwhelming viewers",
                          "complexity_score": 45,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.1.1.0.1.1",
                      "input": "Capture footage using vertical 9:16 aspect ratio with dynamic camera movements and quick scene transitions aligned with platform trends.",
                      "complexity_score": 50,
                      "eval_gen": 2,
                      "subtasks": []
                    },
                    {
                      "task_id": "d694a9e573a0.1.1.0.1.2",
                      "input": "Synchronize video clips with trending audio tracks, implement sound effects, and create audio-visual timing cues.",
                      "complexity_score": 70,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.1.1.0.1.2.0",
                          "input": "Retrieve and validate trending audio tracks from music platforms to ensure synchronization compatibility with video content.",
                          "complexity_score": 65,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.1.1.0.1.2.0.0",
                              "input": "Fetch trending audio track data from major music platforms using their respective APIs.",
                              "complexity_score": 50,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.1.2.0.1",
                              "input": "Verify that metadata (e.g., duration, bitrate, format) of retrieved tracks meets synchronization requirements.",
                              "complexity_score": 45,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.1.2.0.2",
                              "input": "Check alignment of audio track timing and format against video content specifications.",
                              "complexity_score": 40,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        },
                        {
                          "task_id": "d694a9e573a0.1.1.0.1.2.1",
                          "input": "Align video clips to the tempo, rhythm, and key beats of the fetched trending audio tracks while maintaining visual coherence.",
                          "complexity_score": 72,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.1.1.0.1.2.1.0",
                              "input": "Extract tempo, rhythm patterns, and time signatures from the fetched trending audio tracks to establish alignment parameters.",
                              "complexity_score": 62,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.1.2.1.1",
                              "input": "Identify critical audio beats (e.g., downbeats, snare hits) and structural markers (chorus, verse transitions) for synchronization points.",
                              "complexity_score": 65,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.1.2.1.2",
                              "input": "Adjust video clip timing, cuts, and transitions to align with the extracted tempo, rhythm, and key beats from the audio analysis.",
                              "complexity_score": 70,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.1.2.1.3",
                              "input": "Refine video edits to maintain narrative flow, object continuity, and aesthetic consistency during audio-driven timing adjustments.",
                              "complexity_score": 68,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        },
                        {
                          "task_id": "d694a9e573a0.1.1.0.1.2.2",
                          "input": "Overlay contextual sound effects onto the synchronized video-audio output to enhance auditory engagement and realism.",
                          "complexity_score": 68,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.1.1.0.1.2.2.0",
                              "input": "Analyze video content and synchronized audio to determine appropriate contextual sound effects (e.g., ambient sounds, object interactions) that enhance realism without audio masking.",
                              "complexity_score": 62,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.1.2.2.1",
                              "input": "Source or create required sound effect files from audio libraries or synthesis tools, ensuring format compatibility with the video-audio output pipeline.",
                              "complexity_score": 58,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.1.2.2.2",
                              "input": "Time-align acquired sound effects with specific video frames/audio timestamps using timeline markers or frame-accurate positioning tools.",
                              "complexity_score": 65,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.1.2.2.3",
                              "input": "Balance volume levels of overlaid sound effects relative to base audio track to maintain clarity and spatial realism through dynamic range compression and EQ filtering.",
                              "complexity_score": 60,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        },
                        {
                          "task_id": "d694a9e573a0.1.1.0.1.2.3",
                          "input": "Create visual and auditory timing markers to highlight synchronization points between video actions and audio beats.",
                          "complexity_score": 70,
                          "eval_gen": 2,
                          "subtasks": [
                            {
                              "task_id": "d694a9e573a0.1.1.0.1.2.3.0",
                              "input": "Identify video frames where audio beats occur and overlay visual indicators (e.g., flashes, markers) at those positions in the video timeline.",
                              "complexity_score": 38,
                              "eval_gen": 2,
                              "subtasks": []
                            },
                            {
                              "task_id": "d694a9e573a0.1.1.0.1.2.3.1",
                              "input": "Insert short audio cues (e.g., beeps, clicks) at precise timestamps in the audio track corresponding to video action synchronization points.",
                              "complexity_score": 32,
                              "eval_gen": 2,
                              "subtasks": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.1.1.0.1.3",
                      "input": "Apply TikTok-native visual effects, animated overlays, and motion graphics templates to enhance viewer engagement.",
                      "complexity_score": 75,
                      "eval_gen": 2,
                      "subtasks": [
                        {
                          "task_id": "d694a9e573a0.1.1.0.1.3.0",
                          "input": "Select and apply pre-defined visual effects from TikTok's native library to enhance video content",
                          "complexity_score": 25,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.1.1.0.1.3.1",
                          "input": "Add dynamic animated overlays that interact with video content while maintaining platform-specific performance constraints",
                          "complexity_score": 30,
                          "eval_gen": 2,
                          "subtasks": []
                        },
                        {
                          "task_id": "d694a9e573a0.1.1.0.1.3.2",
                          "input": "Integrate TikTok's motion graphics templates with customizable parameters for brand-specific visual storytelling",
                          "complexity_score": 35,
                          "eval_gen": 2,
                          "subtasks": []
                        }
                      ]
                    },
                    {
                      "task_id": "d694a9e573a0.1.1.0.1.4",
                      "input": "Adjust video metadata, compression settings, and content pacing to maximize TikTok's recommendation algorithm performance.",
                      "complexity_score": 50,
                      "eval_gen": 2,
                      "subtasks": []
                    }
                  ]
                }
              ]
            },
            {
              "task_id": "d694a9e573a0.1.1.1",
              "input": "Create static and motion graphics optimized for LinkedIn (professional, informative) and Instagram (visually striking, brand-cohesive). Includes designing posts, carousels, stories, and cover images following platform-specific dimensions and best practices.",
              "complexity_score": 55,
              "eval_gen": 2,
              "subtasks": [
                {
                  "task_id": "d694a9e573a0.1.1.1.0",
                  "input": "Establish the distinct visual and messaging guidelines for each platform. For LinkedIn: define professional tone, information hierarchy, and data visualization styles. For Instagram: define visually striking aesthetic, brand color palette, and cohesive visual motifs. Document all required asset types (posts, carousels, stories, cover images) with their exact dimensions, format specs, and content best practices.",
                  "complexity_score": 25,
                  "eval_gen": 2,
                  "subtasks": []
                },
                {
                  "task_id": "d694a9e573a0.1.1.1.1",
                  "input": "Create all non-animated visual assets. This includes designing individual post images, multi-page carousels, profile/cover images, and story frames. Each asset must be produced in the correct dimensions and optimized for its specific platform (LinkedIn or Instagram) following the strategies defined in ST3-1. Ensure brand consistency across the suite.",
                  "complexity_score": 40,
                  "eval_gen": 2,
                  "subtasks": []
                },
                {
                  "task_id": "d694a9e573a0.1.1.1.2",
                  "input": "Create all animated visual assets. This includes short video posts, animated carousel slides, looping stories, and any animated cover elements. Motion should be tailored to platform expectations: informative and clean for LinkedIn, dynamic and engaging for Instagram. Ensure all animations adhere to platform technical specs (duration, file size, format).",
                  "complexity_score": 45,
                  "eval_gen": 2,
                  "subtasks": []
                },
                {
                  "task_id": "d694a9e573a0.1.1.1.3",
                  "input": "Prepare final graphics for deployment. This involves exporting all static and motion assets in the required file formats (e.g., PNG, JPG, MP4, GIF) at the correct resolutions and file sizes for each platform. Perform a final check to ensure all assets meet the documented dimension requirements and platform best practices before delivery.",
                  "complexity_score": 20,
                  "eval_gen": 2,
                  "subtasks": []
                }
              ]
            },
            {
              "task_id": "d694a9e573a0.1.1.2",
              "input": "Research, outline, and write articles or web copy targeted for search engine optimization. Includes keyword integration, structuring for readability, meta description creation, and ensuring content aligns with the target website's tone and goals.",
              "complexity_score": 60,
              "eval_gen": 2,
              "subtasks": [
                {
                  "task_id": "d694a9e573a0.1.1.2.0",
                  "input": "Identify primary/secondary keywords, analyze search intent, research target audience demographics and preferences",
                  "complexity_score": 15,
                  "eval_gen": 2,
                  "subtasks": []
                },
                {
                  "task_id": "d694a9e573a0.1.1.2.1",
                  "input": "Develop hierarchical structure with H1/H2/H3 headings, determine content flow and logical progression based on research findings",
                  "complexity_score": 10,
                  "eval_gen": 2,
                  "subtasks": []
                },
                {
                  "task_id": "d694a9e573a0.1.1.2.2",
                  "input": "Produce full-length content incorporating keyword clusters naturally, maintain target website's voice and style guidelines",
                  "complexity_score": 20,
                  "eval_gen": 2,
                  "subtasks": []
                },
                {
                  "task_id": "d694a9e573a0.1.1.2.3",
                  "input": "Implement paragraph segmentation, bullet points, transition phrases, and F-pattern reading optimization",
                  "complexity_score": 10,
                  "eval_gen": 2,
                  "subtasks": []
                },
                {
                  "task_id": "d694a9e573a0.1.1.2.4",
                  "input": "Craft title tags, meta descriptions, and Open Graph tags with keyword integration and CTR optimization",
                  "complexity_score": 5,
                  "eval_gen": 2,
                  "subtasks": []
                },
                {
                  "task_id": "d694a9e573a0.1.1.2.5",
                  "input": "Compare content against brand guidelines, adjust language/style to match target website's established tone and objectives",
                  "complexity_score": 10,
                  "eval_gen": 2,
                  "subtasks": []
                }
              ]
            }
          ]
        },
        {
          "task_id": "d694a9e573a0.1.2",
          "input": "Verify visual style, tone alignment, and factual accuracy across all assets through automated checks and human review workflows.",
          "complexity_score": 60,
          "eval_gen": 2,
          "subtasks": [
            {
              "task_id": "d694a9e573a0.1.2.0",
              "input": "Execute automated design validation tools and collect human reviewer feedback against established style guides for all visual assets",
              "complexity_score": 60,
              "eval_gen": 2,
              "subtasks": [
                {
                  "task_id": "d694a9e573a0.1.2.0.0",
                  "input": "Execute automated tools to validate visual assets against established style guides, capturing technical compliance metrics",
                  "complexity_score": 40,
                  "eval_gen": 2,
                  "subtasks": []
                },
                {
                  "task_id": "d694a9e573a0.1.2.0.1",
                  "input": "Distribute visual assets to designated reviewers and gather qualitative feedback aligned with style guide requirements",
                  "complexity_score": 35,
                  "eval_gen": 2,
                  "subtasks": []
                }
              ]
            },
            {
              "task_id": "d694a9e573a0.1.2.1",
              "input": "Run NLP tone analysis models and human editorial reviews to ensure consistent brand voice across textual and multimedia content",
              "complexity_score": 55,
              "eval_gen": 2,
              "subtasks": [
                {
                  "task_id": "d694a9e573a0.1.2.1.0",
                  "input": "Set up and run automated NLP models to analyze textual content for brand voice alignment. This includes selecting appropriate models, processing content batches, and generating tone/consistency reports.",
                  "complexity_score": 35,
                  "eval_gen": 2,
                  "subtasks": []
                },
                {
                  "task_id": "d694a9e573a0.1.2.1.1",
                  "input": "Organize and execute review cycles where human editors assess content (textual and multimedia) for brand voice consistency, using the NLP reports as input and providing qualitative feedback.",
                  "complexity_score": 25,
                  "eval_gen": 2,
                  "subtasks": []
                },
                {
                  "task_id": "d694a9e573a0.1.2.1.2",
                  "input": "Combine automated NLP analysis results with human editorial feedback to create a consolidated assessment of brand voice consistency across all content, identifying patterns and outliers.",
                  "complexity_score": 20,
                  "eval_gen": 2,
                  "subtasks": []
                }
              ]
            },
            {
              "task_id": "d694a9e573a0.1.2.2",
              "input": "Cross-reference asset content with source materials using automated fact-checking systems and subject matter expert validation",
              "complexity_score": 65,
              "eval_gen": 2,
              "subtasks": [
                {
                  "task_id": "d694a9e573a0.1.2.2.0",
                  "input": "Run automated fact-checking algorithms to compare asset content against verified source materials and generate discrepancy reports",
                  "complexity_score": 40,
                  "eval_gen": 2,
                  "subtasks": []
                },
                {
                  "task_id": "d694a9e573a0.1.2.2.1",
                  "input": "Route identified discrepancies to domain experts for manual verification and resolution input",
                  "complexity_score": 50,
                  "eval_gen": 2,
                  "subtasks": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "task_id": "d694a9e573a0.2",
      "input": "Establish and enforce brand voice guidelines across all content formats and distribution channels.",
      "complexity_score": 60,
      "eval_gen": 2,
      "subtasks": [
        {
          "task_id": "d694a9e573a0.2.0",
          "input": "Research audience demographics, analyze competitor positioning, and document core voice principles (tone, style, terminology) through stakeholder workshops",
          "complexity_score": 50,
          "eval_gen": 2,
          "subtasks": []
        },
        {
          "task_id": "d694a9e573a0.2.1",
          "input": "Adapt core voice principles to different content formats (web, social, print) with specific examples, templates, and prohibited language patterns",
          "complexity_score": 40,
          "eval_gen": 2,
          "subtasks": []
        },
        {
          "task_id": "d694a9e573a0.2.2",
          "input": "Create approval workflows, develop channel-specific compliance checklists, and implement monitoring tools for all distribution platforms",
          "complexity_score": 45,
          "eval_gen": 2,
          "subtasks": []
        }
      ]
    },
    {
      "task_id": "d694a9e573a0.3",
      "input": "Deploy analytics tools and KPI frameworks to measure campaign performance against predefined engagement and conversion targets.",
      "complexity_score": 65,
      "eval_gen": 2,
      "subtasks": [
        {
          "task_id": "d694a9e573a0.3.0",
          "input": "Select and configure analytics platforms (e.g., Google Analytics, Mixpanel) to capture campaign data streams",
          "complexity_score": 35,
          "eval_gen": 2,
          "subtasks": []
        },
        {
          "task_id": "d694a9e573a0.3.1",
          "input": "Define and deploy key performance indicators aligned with engagement metrics (click-through rates, session duration) and conversion targets (sales, signups)",
          "complexity_score": 30,
          "eval_gen": 2,
          "subtasks": []
        }
      ]
    }
  ]
}